[
  {
    "id": "CB-2026-001",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "Delegation to UAP",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The LPN is working with an unlicensed assistive personnel (UAP) on a medical-surgical unit. Which task is appropriate for the LPN to assign to the UAP?",
    "choices": [
      "Assisting a stable client with atrial fibrillation to shower",
      "Checking the ability of a client to swallow water after a stroke",
      "Observing while a client with dysphagia begins a thickened liquid diet",
      "Obtaining vital signs on a client 2 hours post blood transfusion"
    ],
    "answer": "Assisting a stable client with atrial fibrillation to shower",
    "rationale": "UAP can assist stable clients with ADLs like showering. UAP cannot perform assessments: swallowing ability requires nursing judgment, dysphagia observation needs RN/LPN, post-transfusion vitals require assessment for reactions. Stable AFib client appropriate for UAP hygiene assistance.",
    "case": {
      "tabs": {
        "case_study": "LPN delegating appropriately to UAP on busy unit",
        "vitals": "Multiple clients with varying acuity",
        "labs": "N/A - delegation scenario",
        "nursing_actions": "Appropriate task assignment based on UAP scope",
        "md_orders": "Various care activities for unit clients"
      }
    }
  },
  {
    "id": "CB-2026-002",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "Monitoring UAP",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse observes a UAP taking a tympanic temperature on a 4-year-old child. Which action by the UAP requires the nurse to intervene?",
    "choices": [
      "Pulling the pinna down and back before inserting the thermometer",
      "Using a clean probe cover for each temperature measurement",
      "Waiting 15 minutes after the child drank cold water",
      "Documenting the temperature reading in the client's medical record"
    ],
    "answer": "Documenting the temperature reading in the client's medical record",
    "rationale": "UAP cannot document in medical records - outside their scope. UAP must report findings to licensed nurse who documents. Pinna down/back correct for children <3 years. Clean probe covers and waiting after cold liquids are appropriate practices.",
    "case": {
      "tabs": {
        "case_study": "Nurse supervising UAP performing pediatric vital signs",
        "vitals": "Temperature measurement in progress",
        "labs": "N/A",
        "nursing_actions": "Monitor UAP performance, ensure proper scope",
        "md_orders": "Routine VS q4h"
      }
    }
  },
  {
    "id": "CB-2026-003",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "Priority Delegation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The charge nurse must assign UAP to provide care for four clients. Which client should the UAP be assigned to first?",
    "choices": [
      "A client with diabetes who needs blood glucose checked before lunch",
      "A client with pneumonia who needs to use the incentive spirometer",
      "A client post-surgery who needs assistance walking in the hallway",
      "A client with heart failure who needs daily weight measurement"
    ],
    "answer": "A client with diabetes who needs blood glucose checked before lunch",
    "rationale": "Blood glucose check is time-sensitive (must be done before meal for insulin dosing). UAP can perform glucose checks. Other tasks are important but less time-critical. Incentive spirometer coaching needs nursing instruction first, ambulation and weights can be done anytime during shift.",
    "case": {
      "tabs": {
        "case_study": "Charge nurse prioritizing UAP assignments on medical unit",
        "vitals": "Multiple clients need care",
        "labs": "Glucose check needed pre-meal",
        "nursing_actions": "Prioritize time-sensitive tasks",
        "md_orders": "Fingerstick glucose AC meals, daily weights, ambulation TID"
      }
    }
  },
  {
    "id": "CB-2026-004",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "SBAR Communication",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is using SBAR to communicate with the provider about a client with worsening respiratory status. Which statement represents the 'A' (Assessment) component?",
    "choices": [
      "The client has COPD and was admitted 2 days ago with exacerbation",
      "I think the client may be developing pneumonia and needs antibiotics",
      "Oxygen saturation has dropped from 94% to 88% despite increased oxygen",
      "I need you to come evaluate the client and order a chest X-ray"
    ],
    "answer": "I think the client may be developing pneumonia and needs antibiotics",
    "rationale": "SBAR: S=Situation (current problem), B=Background (history), A=Assessment (your clinical judgment/conclusion), R=Recommendation (what you want done). 'I think the client may be developing pneumonia' is the nurse's assessment. History=Background, vital changes=Situation, requesting orders=Recommendation.",
    "case": {
      "tabs": {
        "case_study": "Nurse communicating urgent client status change to provider",
        "vitals": "SpO2 dropped from 94% to 88%, increased work of breathing",
        "labs": "Pending chest X-ray",
        "nursing_actions": "Using SBAR for clear communication",
        "md_orders": "Awaiting provider response"
      }
    }
  },
  {
    "id": "CB-2026-005",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "Postoperative Delegation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client had an open cholecystectomy 6 hours ago. Which task can the nurse delegate to the UAP?",
    "choices": [
      "Assisting the client to turn, cough, and deep breathe",
      "Assessing the surgical dressing for drainage",
      "Administering prescribed analgesic medication",
      "Evaluating the client's pain level after medication"
    ],
    "answer": "Assisting the client to turn, cough, and deep breathe",
    "rationale": "UAP can assist with positioning and remind client to cough/deep breathe (after initial nursing instruction). UAP cannot assess (dressing, pain evaluation) or administer medications. These require licensed nursing judgment.",
    "case": {
      "tabs": {
        "case_study": "Postop cholecystectomy client needing routine care",
        "vitals": "Stable postop, VS WNL",
        "labs": "Postop day 0",
        "nursing_actions": "Delegate appropriate tasks, maintain postop care",
        "md_orders": "Turn q2h, incentive spirometry q1h, pain meds PRN"
      }
    }
  },
  {
    "id": "CB-2026-006",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "Short Staffing",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is assigned to care for 8 clients but feels this is unsafe due to their acuity levels. What is the most appropriate action?",
    "choices": [
      "Accept the assignment and do the best job possible under the circumstances",
      "Refuse the assignment and leave the facility immediately",
      "Document concerns and notify the charge nurse and nursing supervisor",
      "Call other nurses to complain about the unsafe staffing situation"
    ],
    "answer": "Document concerns and notify the charge nurse and nursing supervisor",
    "rationale": "Nurse must document concerns in writing and follow chain of command (charge nurse, supervisor). Cannot abandon clients by leaving. Accepting unsafe assignment without documentation puts license at risk. Complaining to peers doesn't protect clients or document concerns officially.",
    "case": {
      "tabs": {
        "case_study": "Nurse concerned about unsafe staffing ratios",
        "vitals": "Multiple high-acuity clients",
        "labs": "N/A - staffing scenario",
        "nursing_actions": "Follow proper channels for safety concerns",
        "md_orders": "Complex care needs exceed safe staffing"
      }
    }
  },
  {
    "id": "CB-2026-007",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "PEG Tube Delegation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client has a percutaneous endoscopic gastrostomy (PEG) tube for nutrition. Which aspect of PEG tube care can the nurse delegate to the UAP?",
    "choices": [
      "Administering the tube feeding formula through the PEG tube",
      "Assessing the skin around the PEG tube insertion site for redness",
      "Providing mouth care and keeping the client's lips moist",
      "Checking residual volume before administering tube feeding"
    ],
    "answer": "Providing mouth care and keeping the client's lips moist",
    "rationale": "UAP can provide basic hygiene including mouth care. UAP cannot administer tube feedings, assess insertion sites, or check residuals - these require nursing knowledge and judgment. Mouth care is within UAP scope for NPO clients with feeding tubes.",
    "case": {
      "tabs": {
        "case_study": "Client with PEG tube receiving continuous feeding",
        "vitals": "Stable, tolerating feeds",
        "labs": "N/A",
        "nursing_actions": "Delegate appropriate hygiene care",
        "md_orders": "Continuous tube feeding, mouth care q4h"
      }
    }
  },
  {
    "id": "CB-2026-008",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "Nurse Practice Act",
    "difficulty": 5,
    "qtype": "single",
    "stem": "Which statement best describes the purpose of the Nurse Practice Act?",
    "choices": [
      "Defines the scope of practice for nurses in each state",
      "Sets the standards for nursing education programs nationally",
      "Establishes guidelines for nurse-to-client ratios in hospitals",
      "Determines the salary ranges for licensed nurses"
    ],
    "answer": "Defines the scope of practice for nurses in each state",
    "rationale": "Nurse Practice Act is state legislation that defines nursing scope of practice, licensure requirements, and grounds for disciplinary action. It protects public by ensuring nurses practice competently within their legal scope. Does not set education standards (accrediting bodies), staffing ratios (facility/state policy), or salaries (market/unions).",
    "case": {
      "tabs": {
        "case_study": "Understanding legal boundaries of nursing practice",
        "vitals": "N/A - legal/professional knowledge",
        "labs": "N/A",
        "nursing_actions": "Practice within legal scope",
        "md_orders": "N/A"
      }
    }
  },
  {
    "id": "CB-2026-009",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "TB Infection Control",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with active pulmonary tuberculosis is admitted to the medical unit. Which action by the UAP requires immediate intervention by the nurse?",
    "choices": [
      "Wearing an N95 respirator when entering the client's room",
      "Placing the client in a private room with negative air pressure",
      "Leaving the door to the client's room open for better air circulation",
      "Using standard precautions in addition to airborne precautions"
    ],
    "answer": "Leaving the door to the client's room open for better air circulation",
    "rationale": "Airborne precautions for TB require keeping door CLOSED to maintain negative pressure and prevent spread. N95 respirator, negative pressure room, and standard precautions (plus airborne) are all correct. Open door defeats purpose of negative pressure isolation.",
    "case": {
      "tabs": {
        "case_study": "Active TB case requiring proper airborne precautions",
        "vitals": "Afebrile on treatment, cough productive",
        "labs": "AFB smear positive, on 4-drug therapy",
        "nursing_actions": "Airborne precautions, N95 required, negative pressure room",
        "md_orders": "Airborne isolation, respiratory precautions"
      }
    }
  },
  {
    "id": "CB-2026-010",
    "bank": "Compass B",
    "system": "Leadership/Management",
    "topic": "Multiple Sclerosis Care Delegation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with multiple sclerosis has weakness and requires assistance with activities of daily living. Which task is most appropriate to assign to the UAP?",
    "choices": [
      "Teaching the client energy conservation techniques",
      "Assessing the client's muscle strength and coordination",
      "Helping the client with morning hygiene and grooming",
      "Evaluating the client's response to prescribed medications"
    ],
    "answer": "Helping the client with morning hygiene and grooming",
    "rationale": "UAP can assist with ADLs (hygiene, grooming) for clients with stable conditions. UAP cannot teach (energy conservation), assess (muscle strength), or evaluate (medication response) - these require licensed nursing knowledge and judgment.",
    "case": {
      "tabs": {
        "case_study": "MS client with stable weakness requiring ADL assistance",
        "vitals": "Stable, chronic condition",
        "labs": "N/A",
        "nursing_actions": "Appropriate delegation of routine ADL care",
        "md_orders": "Assist with ADLs PRN, energy conservation techniques"
      }
    }
  },
  {
    "id": "CB-2026-011",
    "bank": "Compass B",
    "system": "Immune/Hematology",
    "topic": "Anemia Interventions",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with iron-deficiency anemia is prescribed ferrous sulfate 325 mg PO TID. Which instruction should the nurse include in the teaching?",
    "choices": [
      "Take the medication with milk to prevent stomach upset",
      "Expect stools to become dark green or black in color",
      "Take the medication with antacids to reduce gastric irritation",
      "Avoid taking the medication with vitamin C supplements"
    ],
    "answer": "Expect stools to become dark green or black in color",
    "rationale": "Iron supplements cause dark green/black stools - normal and expected. Take iron on empty stomach or with vitamin C (enhances absorption), NOT with milk, antacids, or calcium (decrease absorption). GI upset is common; can take with food if severe but absorption decreases.",
    "case": {
      "tabs": {
        "case_study": "Client with iron-deficiency anemia starting oral iron therapy",
        "vitals": "Stable, fatigued",
        "labs": "Hgb 9.2, Hct 28%, MCV 72 (low), ferritin 8 (low)",
        "nursing_actions": "Patient education on iron therapy, dietary teaching",
        "md_orders": "Ferrous sulfate 325mg PO TID, increase iron-rich foods"
      }
    }
  },
  {
    "id": "CB-2026-012",
    "bank": "Compass B",
    "system": "Immune/Hematology",
    "topic": "Blood Transfusion Reaction",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client receiving a blood transfusion develops fever 100.4°F, chills, and back pain 30 minutes after the transfusion started. What is the nurse's priority action?",
    "choices": [
      "Slow the infusion rate to 50 mL/hour and monitor closely",
      "Stop the transfusion immediately and keep the IV line open with normal saline",
      "Administer acetaminophen 650 mg PO for the fever",
      "Continue the transfusion and notify the provider of the fever"
    ],
    "answer": "Stop the transfusion immediately and keep the IV line open with normal saline",
    "rationale": "Fever, chills, back pain = transfusion reaction. STOP transfusion immediately, maintain IV access with NS (don't use blood tubing), notify provider, save blood bag/tubing, check vitals, may need diphenhydramine or epinephrine. Don't slow rate or continue - could worsen reaction. Don't give antipyretics until after provider assessment.",
    "case": {
      "tabs": {
        "case_study": "Client experiencing acute transfusion reaction",
        "vitals": "Temp 100.4°F, HR 108, BP 138/88, back pain",
        "labs": "Type and cross match on file, 300 mL PRBCs infused",
        "nursing_actions": "Stop transfusion, maintain IV access, notify provider STAT",
        "md_orders": "Transfusion started 30 min ago, now reaction present"
      }
    }
  },
  {
    "id": "CB-2026-013",
    "bank": "Compass B",
    "system": "Immune/Hematology",
    "topic": "Anemia Assessment",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is assessing a client with suspected anemia. Which finding would be most concerning?",
    "choices": [
      "Conjunctiva pale pink in color",
      "Client reports feeling tired and weak",
      "Hemoglobin 10.2 g/dL and hematocrit 32%",
      "Heart rate 118 bpm with shortness of breath"
    ],
    "answer": "Heart rate 118 bpm with shortness of breath",
    "rationale": "Tachycardia and dyspnea indicate inadequate tissue oxygenation - compensatory response to anemia. This suggests severe anemia or cardiac decompensation requiring immediate intervention. Pale conjunctiva, fatigue, and low Hgb/Hct (10.2/32%) are expected findings in anemia but less immediately concerning than cardiac/respiratory symptoms.",
    "case": {
      "tabs": {
        "case_study": "Client with anemia showing signs of cardiac compensation",
        "vitals": "HR 118, RR 24, BP 102/68, SpO2 92% RA",
        "labs": "Hgb 10.2, Hct 32%, MCV pending",
        "nursing_actions": "Monitor cardiac status, oxygen if needed, assess severity",
        "md_orders": "CBC with differential, iron studies, possible transfusion"
      }
    }
  },
  {
    "id": "CB-2026-014",
    "bank": "Compass B",
    "system": "Immune/Hematology",
    "topic": "Sickle Cell Crisis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 24-year-old client with sickle cell disease presents to the ED with severe bone pain rated 9/10. Which intervention is the priority?",
    "choices": [
      "Administer prescribed IV opioid analgesic",
      "Apply heating pads to painful areas",
      "Start IV normal saline at 150 mL/hour",
      "Encourage oral fluids to 3 liters per day"
    ],
    "answer": "Administer prescribed IV opioid analgesic",
    "rationale": "Sickle cell crisis management priorities: (1) pain control with opioids, (2) hydration, (3) oxygen if hypoxic. Severe pain (9/10) needs immediate IV opioid relief. Then start aggressive IV hydration. Heat helps but pain medication is priority. Oral fluids too slow for crisis. Pain untreated causes further vasoocclusion.",
    "case": {
      "tabs": {
        "case_study": "24F with sickle cell vaso-occlusive crisis, severe pain",
        "vitals": "HR 118, BP 128/82, RR 22, SpO2 96% RA, pain 9/10",
        "labs": "Baseline Hgb 8.1 (chronic), possible acute drop",
        "nursing_actions": "Pain management priority, then hydration",
        "md_orders": "Morphine 4-6mg IV q2h PRN, NS bolus then 150 mL/hr, oxygen if SpO2 <92%"
      }
    }
  },
  {
    "id": "CB-2026-015",
    "bank": "Compass B",
    "system": "Immune/Hematology",
    "topic": "Pernicious Anemia",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with pernicious anemia is prescribed vitamin B12 (cyanocobalamin) injections. Which statement by the client indicates understanding of the teaching?",
    "choices": [
      "I will need these injections until my anemia resolves, then I can stop",
      "I will need to receive these injections for the rest of my life",
      "I can take oral B12 supplements instead of getting injections",
      "I will need injections only during times when my anemia worsens"
    ],
    "answer": "I will need to receive these injections for the rest of my life",
    "rationale": "Pernicious anemia is caused by lack of intrinsic factor (cannot absorb B12 orally). Requires lifelong IM or SubQ B12 injections (monthly maintenance). Oral B12 won't work. Not temporary - permanent loss of intrinsic factor. Cannot wait for symptoms to worsen.",
    "case": {
      "tabs": {
        "case_study": "Client with newly diagnosed pernicious anemia",
        "vitals": "Stable",
        "labs": "Macrocytic anemia, low B12, positive IF antibodies",
        "nursing_actions": "Patient education on lifelong B12 replacement",
        "md_orders": "Cyanocobalamin 1000 mcg IM weekly x4 weeks, then monthly"
      }
    }
  },
  {
    "id": "CB-2026-016",
    "bank": "Compass B",
    "system": "Immune/Hematology",
    "topic": "Postoperative Anemia",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client's postoperative lab results show Hgb 7.8 g/dL (preop 12.4 g/dL), Hct 24%, platelets 180,000. Which finding should the nurse report to the surgeon immediately?",
    "choices": [
      "Client reports feeling lightheaded when getting out of bed",
      "Surgical dressing has small amount of serosanguineous drainage",
      "Client's heart rate increased from 78 to 92 bpm",
      "Jackson-Pratt drain output is 150 mL in 8 hours"
    ],
    "answer": "Jackson-Pratt drain output is 150 mL in 8 hours",
    "rationale": "Hgb dropped from 12.4 to 7.8 (4.6 point drop) indicates significant bleeding. JP drain output 150 mL/8hr suggests ongoing blood loss requiring surgical evaluation. Lightheadedness and increased HR are expected with anemia. Small serosanguineous drainage is normal postop. Focus on finding SOURCE of blood loss.",
    "case": {
      "tabs": {
        "case_study": "Postop client with significant Hgb drop suggesting ongoing bleeding",
        "vitals": "HR 92 (was 78), BP 108/68, orthostatic changes present",
        "labs": "Hgb 7.8 (dropped from 12.4), Hct 24%, platelets normal",
        "nursing_actions": "Monitor for bleeding source, notify surgeon of drain output",
        "md_orders": "Monitor closely, may need transfusion"
      }
    }
  },
  {
    "id": "CB-2026-017",
    "bank": "Compass B",
    "system": "Immune/Hematology",
    "topic": "Thrombocytopenia Precautions",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with thrombocytopenia (platelet count 45,000) is on bleeding precautions. Which action by the UAP requires the nurse to intervene?",
    "choices": [
      "Using an electric razor for the client's morning shave",
      "Taking a rectal temperature with a digital thermometer",
      "Assisting the client to brush teeth with a soft toothbrush",
      "Applying pressure to a venipuncture site for 5 minutes"
    ],
    "answer": "Taking a rectal temperature with a digital thermometer",
    "rationale": "NO rectal temperatures with low platelets - risk of bleeding from rectal trauma. Use oral, tympanic, or axillary routes. Electric razor (not bladed), soft toothbrush, and prolonged pressure to sites are all appropriate bleeding precautions for thrombocytopenia.",
    "case": {
      "tabs": {
        "case_study": "Client with severe thrombocytopenia requiring bleeding precautions",
        "vitals": "Stable, no active bleeding",
        "labs": "Platelets 45,000 (normal 150-400K), rest of CBC stable",
        "nursing_actions": "Bleeding precautions: avoid IM injections, rectal temps, invasive procedures",
        "md_orders": "Bleeding precautions, monitor for petechiae/ecchymosis"
      }
    }
  },
  {
    "id": "CB-2026-018",
    "bank": "Compass B",
    "system": "Immune/Hematology",
    "topic": "Hemophilia Teaching",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is teaching the parents of a 6-year-old child with hemophilia A. Which statement by the parents indicates a need for further teaching?",
    "choices": [
      "We will make sure he wears a medical alert bracelet at all times",
      "We will encourage him to participate in contact sports like football",
      "We will apply pressure and ice to any bleeding sites immediately",
      "We will keep factor VIII concentrate available at home for emergencies"
    ],
    "answer": "We will encourage him to participate in contact sports like football",
    "rationale": "NO contact sports (football, hockey, boxing) with hemophilia - high risk of bleeding from trauma. Encourage swimming, golf, tennis instead. Medical alert bracelet, pressure/ice for bleeding, and home factor VIII are all appropriate for hemophilia management.",
    "case": {
      "tabs": {
        "case_study": "Family education for child with hemophilia A",
        "vitals": "N/A - educational scenario",
        "labs": "Factor VIII deficiency confirmed",
        "nursing_actions": "Teach bleeding precautions and emergency management",
        "md_orders": "Factor VIII replacement PRN bleeding, avoid contact sports"
      }
    }
  },
  {
    "id": "CB-2026-019",
    "bank": "Compass B",
    "system": "Respiratory",
    "topic": "Respiratory Distress Newborn",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A newborn is showing signs of respiratory distress with grunting, nasal flaring, and retractions. Which action should the nurse take first?",
    "choices": [
      "Notify the pediatrician immediately about the distress",
      "Suction the infant's nose and mouth to clear secretions",
      "Position the infant supine and provide warmth",
      "Place the infant in prone position to open airways"
    ],
    "answer": "Suction the infant's nose and mouth to clear secretions",
    "rationale": "First action for newborn respiratory distress: clear airway (suction nose/mouth). Then position (elevate head), provide oxygen if needed, keep warm, notify provider. ABC priority - airway first. Supine OK for resuscitation but head should be elevated. Never prone for acute distress (safe sleep only).",
    "case": {
      "tabs": {
        "case_study": "Newborn with respiratory distress requiring immediate intervention",
        "vitals": "RR 72, grunting, flaring, retractions, SpO2 89%",
        "labs": "Term infant, possible TTN or RDS",
        "nursing_actions": "Clear airway, position, oxygen, notify provider",
        "md_orders": "Monitor respiratory status, oxygen PRN"
      }
    }
  },
  {
    "id": "CB-2026-020",
    "bank": "Compass B",
    "system": "Respiratory",
    "topic": "RSV Precautions",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 6-month-old infant is admitted with respiratory syncytial virus (RSV). How long after symptom onset is RSV considered contagious?",
    "choices": [
      "24 hours after symptoms begin",
      "3-8 days after symptoms begin",
      "10-14 days after symptoms begin",
      "No longer contagious once admitted to hospital"
    ],
    "answer": "3-8 days after symptoms begin",
    "rationale": "RSV contagious period: typically 3-8 days after symptom onset (can be longer in infants/immunocompromised). Requires contact + droplet precautions. Not just 24 hours. Can shed virus for weeks in some cases. Definitely still contagious upon hospital admission.",
    "case": {
      "tabs": {
        "case_study": "Infant with RSV requiring isolation precautions",
        "vitals": "RR 58, wheezing, nasal congestion, SpO2 91% RA",
        "labs": "RSV rapid antigen positive",
        "nursing_actions": "Contact + droplet precautions, monitor respiratory status",
        "md_orders": "Isolation precautions, oxygen to maintain SpO2 >90%, supportive care"
      }
    }
  },
  {
    "id": "CB-2026-021",
    "bank": "Compass B",
    "system": "Respiratory",
    "topic": "Incentive Spirometry",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is teaching a postoperative client how to use an incentive spirometer. Which instruction is correct?",
    "choices": [
      "Use the spirometer every hour while awake",
      "Breathe in quickly to raise the balls as fast as possible",
      "Lie flat in bed when using the spirometer",
      "Exhale into the spirometer to expand the lungs"
    ],
    "answer": "Use the spirometer every hour while awake",
    "rationale": "Incentive spirometer: use q1-2h while awake (not sleeping). INHALE slowly and deeply (not quickly) to raise indicator. Sit upright or at least 45 degrees (not flat). INHALE (not exhale) - device measures inspiratory volume to expand alveoli and prevent atelectasis.",
    "case": {
      "tabs": {
        "case_study": "Postop client learning incentive spirometry for atelectasis prevention",
        "vitals": "Postop day 1, stable",
        "labs": "N/A",
        "nursing_actions": "Teaching proper IS technique",
        "md_orders": "Incentive spirometry q1h while awake, ambulate TID"
      }
    }
  },
  {
    "id": "CB-2026-022",
    "bank": "Compass B",
    "system": "Respiratory",
    "topic": "COPD Management",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with COPD is using pursed-lip breathing. Which statement by the client indicates correct understanding of this technique?",
    "choices": [
      "I breathe in through pursed lips and out through my nose",
      "I inhale through my nose and exhale slowly through pursed lips",
      "I breathe rapidly in and out through pursed lips",
      "I hold my breath for 10 seconds with lips pursed"
    ],
    "answer": "I inhale through my nose and exhale slowly through pursed lips",
    "rationale": "Pursed-lip breathing for COPD: inhale through nose, exhale SLOWLY through pursed lips (like whistling). Creates back-pressure to keep airways open, prevents air trapping, prolongs exhalation. Should be slow, not rapid. Don't hold breath.",
    "case": {
      "tabs": {
        "case_study": "COPD client learning breathing techniques",
        "vitals": "Stable on home O2",
        "labs": "Baseline ABG on file",
        "nursing_actions": "Teaching pursed-lip breathing for dyspnea management",
        "md_orders": "Pulmonary rehab, breathing exercises"
      }
    }
  },
  {
    "id": "CB-2026-023",
    "bank": "Compass B",
    "system": "Respiratory",
    "topic": "Oxygen Priority",
    "difficulty": 5,
    "qtype": "single",
    "stem": "Four clients are wearing nasal cannulas. Which client should the nurse check on first?",
    "choices": [
      "Client with COPD receiving oxygen at 2 L/min with SpO2 90%",
      "Client with pneumonia receiving oxygen at 4 L/min with SpO2 94%",
      "Client with heart failure receiving oxygen at 3 L/min with SpO2 88%",
      "Postoperative client receiving oxygen at 2 L/min with SpO2 96%"
    ],
    "answer": "Client with heart failure receiving oxygen at 3 L/min with SpO2 88%",
    "rationale": "SpO2 88% is too low (goal >90-92%). Client with HF needs assessment for pulmonary edema and may need increased oxygen. COPD client at 90% is appropriate (target 88-92% for CO2 retainers). Pneumonia at 94% and postop at 96% are acceptable.",
    "case": {
      "tabs": {
        "case_study": "Multiple clients on oxygen - prioritize based on oxygenation",
        "vitals": "HF client: SpO2 88%, may need intervention",
        "labs": "Various",
        "nursing_actions": "Assess client with lowest appropriate SpO2",
        "md_orders": "Oxygen to maintain adequate saturations"
      }
    }
  },
  {
    "id": "CB-2026-024",
    "bank": "Compass B",
    "system": "Respiratory",
    "topic": "Chest Tube",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client has a chest tube connected to a water seal drainage system. The nurse notes continuous bubbling in the water seal chamber. What does this indicate?",
    "choices": [
      "The chest tube is functioning properly",
      "There is an air leak in the system",
      "The lung has fully re-expanded",
      "The suction pressure needs to be increased"
    ],
    "answer": "There is an air leak in the system",
    "rationale": "Water seal chamber: INTERMITTENT bubbling with exhalation = normal (air from pleural space). CONTINUOUS bubbling = air leak in system (loose connection or pneumothorax). Check connections first, then notify provider. Tidaling (fluctuation with breathing) indicates patency. Continuous bubbling is never normal.",
    "case": {
      "tabs": {
        "case_study": "Post-thoracotomy client with chest tube and water seal drainage",
        "vitals": "Stable, no respiratory distress",
        "labs": "CXR yesterday showed small pneumothorax",
        "nursing_actions": "Check all connections for air leak, notify provider if leak persists",
        "md_orders": "Chest tube to water seal, monitor drainage and air leak"
      }
    }
  },
  {
    "id": "CB-2026-025",
    "bank": "Compass B",
    "system": "Respiratory",
    "topic": "Sleep Apnea",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with obstructive sleep apnea is prescribed a CPAP machine. Which statement by the client indicates understanding of the treatment?",
    "choices": [
      "I only need to use the CPAP when I feel tired during the day",
      "The CPAP will cure my sleep apnea so I can stop using it eventually",
      "I should use the CPAP every night during sleep",
      "I can skip using the CPAP if I sleep on my side"
    ],
    "answer": "I should use the CPAP every night during sleep",
    "rationale": "CPAP must be used EVERY night during sleep for effectiveness. Provides continuous positive pressure to keep airway open. Not a cure - ongoing treatment. Using nightly improves oxygenation, reduces cardiovascular complications, improves daytime alertness. Side sleeping helps but doesn't replace CPAP.",
    "case": {
      "tabs": {
        "case_study": "Client with OSA starting CPAP therapy",
        "vitals": "Baseline: multiple apnea episodes per hour",
        "labs": "Sleep study showed severe OSA",
        "nursing_actions": "Teaching proper CPAP use and adherence",
        "md_orders": "CPAP nightly, follow-up sleep study in 3 months"
      }
    }
  },
  {
    "id": "CB-2026-026",
    "bank": "Compass B",
    "system": "Respiratory",
    "topic": "Chest Tube Removal Equipment",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is assisting with chest tube removal. Which equipment should be available at the bedside?",
    "choices": [
      "Sterile petroleum gauze and tape",
      "Sterile 4x4 gauze and Montgomery straps",
      "Transparent adhesive dressing only",
      "No dressing needed after chest tube removal"
    ],
    "answer": "Sterile petroleum gauze and tape",
    "rationale": "Chest tube removal requires: petroleum gauze (creates airtight seal), tape (occlusive dressing on 3 sides), and supplies for provider. Petroleum gauze prevents air from entering pleural space. Regular gauze not occlusive. Transparent dressing not adequate. Must dress immediately.",
    "case": {
      "tabs": {
        "case_study": "Client ready for chest tube removal after lung re-expansion",
        "vitals": "Stable, breathing comfortably",
        "labs": "CXR shows full lung expansion, no pneumothorax",
        "nursing_actions": "Prepare equipment, assist provider, apply occlusive dressing",
        "md_orders": "Remove chest tube, CXR 2 hours post-removal"
      }
    }
  },
  {
    "id": "CB-2026-027",
    "bank": "Compass B",
    "system": "Integumentary/Wound",
    "topic": "Wound Care Procedure",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is performing a sterile dressing change on a surgical wound. In which order should the nurse perform the steps? Place in correct sequence.",
    "choices": [
      "Wash hands, remove old dressing, clean wound, apply new dressing, document",
      "Remove old dressing, wash hands, put on sterile gloves, clean wound, apply new dressing",
      "Wash hands, put on clean gloves, remove old dressing, perform hand hygiene, put on sterile gloves, clean wound, apply new dressing",
      "Put on sterile gloves, remove old dressing, clean wound, apply new dressing"
    ],
    "answer": "Wash hands, put on clean gloves, remove old dressing, perform hand hygiene, put on sterile gloves, clean wound, apply new dressing",
    "rationale": "Sterile dressing change sequence: (1) hand hygiene, (2) CLEAN gloves to remove old dressing, (3) hand hygiene again, (4) STERILE gloves/technique for cleaning wound and applying new dressing, (5) document. Don't use sterile gloves to remove contaminated dressing. Must rewash hands between removal and application.",
    "case": {
      "tabs": {
        "case_study": "Postop wound requiring sterile dressing change",
        "vitals": "Stable",
        "labs": "N/A",
        "nursing_actions": "Perform sterile technique for wound care",
        "md_orders": "Dressing change daily and PRN"
      }
    }
  },
  {
    "id": "CB-2026-028",
    "bank": "Compass B",
    "system": "Integumentary/Wound",
    "topic": "Purulent Drainage",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse notes purulent, foul-smelling drainage from a client's abdominal surgical incision. Which action is the priority?",
    "choices": [
      "Change the dressing and clean the wound with normal saline",
      "Obtain a wound culture before cleaning the wound",
      "Document the findings in the client's medical record",
      "Apply a dry sterile dressing over the current dressing"
    ],
    "answer": "Obtain a wound culture before cleaning the wound",
    "rationale": "Purulent, foul drainage = infection. Get wound culture BEFORE cleaning (cleaning removes organisms, decreases accuracy). Then clean wound, notify provider, document. Reinforcing dressing delays treatment. Culture first for accurate identification of organism and appropriate antibiotic selection.",
    "case": {
      "tabs": {
        "case_study": "Postop wound showing signs of infection",
        "vitals": "Temp 101.2°F, wound red, purulent drainage noted",
        "labs": "WBC pending, wound culture needed",
        "nursing_actions": "Culture before cleaning, notify provider for antibiotics",
        "md_orders": "Wound care, culture if infection suspected"
      }
    }
  },
  {
    "id": "CB-2026-029",
    "bank": "Compass B",
    "system": "Integumentary/Wound",
    "topic": "Colostomy Skin Care",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with a new colostomy reports burning and itching around the stoma site. The nurse notes redness of the peristomal skin. What is the most likely cause?",
    "choices": [
      "Normal healing process after colostomy creation",
      "Allergic reaction to the ostomy appliance adhesive",
      "Leakage of stool under the ostomy wafer irritating skin",
      "Infection at the surgical site requiring antibiotics"
    ],
    "answer": "Leakage of stool under the ostomy wafer irritating skin",
    "rationale": "Burning, itching, redness around stoma = chemical irritation from stool leakage under wafer. Colostomy output is caustic. Need proper fit (wafer opening should be 1/8 inch larger than stoma). Not normal healing. Adhesive allergy would be broader area. Infection has different presentation (warmth, drainage, fever).",
    "case": {
      "tabs": {
        "case_study": "New colostomy with peristomal skin breakdown from improper fit",
        "vitals": "Afebrile, no systemic infection",
        "labs": "N/A",
        "nursing_actions": "Refit wafer properly, protect skin with barrier, teach proper application",
        "md_orders": "Ostomy care, barrier cream/powder PRN"
      }
    }
  },
  {
    "id": "CB-2026-030",
    "bank": "Compass B",
    "system": "Integumentary/Wound",
    "topic": "Radiation Skin Care",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client receiving external beam radiation therapy for breast cancer asks about skin care. Which instruction should the nurse provide?",
    "choices": [
      "Apply lotion before each radiation treatment to moisturize the skin",
      "Wash the treatment area with antibacterial soap daily",
      "Avoid removing the ink markings on the skin",
      "Expose the treated area to sunlight for healing"
    ],
    "answer": "Avoid removing the ink markings on the skin",
    "rationale": "Radiation skin care: DON'T remove ink marks (needed for precise treatment), DON'T apply lotions/creams before treatment, DON'T use soap (gentle cleanser only), AVOID sun exposure (radiation makes skin fragile/sensitive). Protect skin, keep clean and dry, use approved moisturizers AFTER treatment.",
    "case": {
      "tabs": {
        "case_study": "Client receiving radiation therapy requiring skin protection teaching",
        "vitals": "Stable",
        "labs": "N/A",
        "nursing_actions": "Teach radiation skin care precautions",
        "md_orders": "External beam radiation to left breast, 5 days/week x6 weeks"
      }
    }
  },
  {
    "id": "CB-2026-031",
    "bank": "Compass B",
    "system": "Integumentary/Wound",
    "topic": "Pressure Injury Prevention",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A bedridden client is at high risk for pressure injuries. Which intervention is most effective in preventing pressure injury development?",
    "choices": [
      "Massaging bony prominences to improve circulation",
      "Repositioning the client every 4 hours",
      "Turning the client every 2 hours and using pressure-relief devices",
      "Keeping the head of bed elevated at 45 degrees continuously"
    ],
    "answer": "Turning the client every 2 hours and using pressure-relief devices",
    "rationale": "Pressure injury prevention: reposition every 2 hours (not 4), use pressure-relief surfaces (foam, air mattress), keep skin clean/dry, optimize nutrition. NEVER massage bony prominences (can damage tissue). HOB <30 degrees when possible (shearing forces with elevation). Two-hour turning is gold standard.",
    "case": {
      "tabs": {
        "case_study": "Immobile client requiring aggressive pressure injury prevention",
        "vitals": "Bedbound, limited mobility",
        "labs": "Albumin 2.8 (low - poor nutrition increases risk)",
        "nursing_actions": "Q2h turning schedule, pressure-relief mattress, skin assessment",
        "md_orders": "Pressure injury prevention protocol, nutrition consult"
      }
    }
  },
  {
    "id": "CB-2026-032",
    "bank": "Compass B",
    "system": "Integumentary/Wound",
    "topic": "IV Site Assessment",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is assessing a client's peripheral IV site and notes swelling, coolness, and pain around the insertion site. What should the nurse recognize?",
    "choices": [
      "Phlebitis requiring warm compresses and antibiotics",
      "Infiltration requiring discontinuation of the IV",
      "Normal findings that require only documentation",
      "Infection requiring blood cultures and IV removal"
    ],
    "answer": "Infiltration requiring discontinuation of the IV",
    "rationale": "Infiltration signs: swelling, coolness, pain, no blood return. IV fluid leaking into tissue. STOP IV immediately, remove catheter, elevate extremity, apply warm OR cool compress (depends on solution). Phlebitis = warmth, redness, cord-like vein. Infection = warmth, redness, purulent drainage. This is infiltration.",
    "case": {
      "tabs": {
        "case_study": "Client with infiltrated IV requiring immediate discontinuation",
        "vitals": "Stable",
        "labs": "N/A",
        "nursing_actions": "Remove IV, assess site, restart IV in different location",
        "md_orders": "IV fluids continuous, restart if infiltrated"
      }
    }
  },
  {
    "id": "CB-2026-033",
    "bank": "Compass B",
    "system": "End-of-Life/Palliative Care",
    "topic": "Mottling Recognition",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse notes mottling of a hospice client's lower extremities. What does this finding indicate?",
    "choices": [
      "The client is developing peripheral vascular disease",
      "The client is experiencing a blood clot in the legs",
      "The client is in the active dying process",
      "The client needs immediate warming measures"
    ],
    "answer": "The client is in the active dying process",
    "rationale": "Mottling (bluish, patchy discoloration) in dying clients = decreased peripheral circulation as body shuts down. Sign of imminent death (hours to days). Not PVD or DVT. Don't warm - natural dying process. Other signs: decreased BP, irregular breathing, cool extremities, decreased consciousness. Prepare family.",
    "case": {
      "tabs": {
        "case_study": "Hospice client showing signs of active dying",
        "vitals": "BP 88/52, HR 52 irregular, mottled lower extremities",
        "labs": "N/A - comfort care only",
        "nursing_actions": "Comfort measures, family support, recognize dying process",
        "md_orders": "Comfort care, morphine PRN, family at bedside"
      }
    }
  },
  {
    "id": "CB-2026-034",
    "bank": "Compass B",
    "system": "End-of-Life/Palliative Care",
    "topic": "Grieving Spouse",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The spouse of a client who died 30 minutes ago says, I just don't know what I'm going to do without him. Which response by the nurse is most therapeutic?",
    "choices": [
      "He's in a better place now and no longer suffering",
      "You have other family members who can support you",
      "This must be very difficult for you right now",
      "Try not to think about it, focus on happy memories instead"
    ],
    "answer": "This must be very difficult for you right now",
    "rationale": "Therapeutic communication for grief: acknowledge feelings, offer presence, avoid platitudes. 'This must be very difficult' validates grief and offers support. Don't minimize ('better place', 'others can support'), don't tell them what to do ('try not to think about it'). Stay present, listen, acknowledge pain.",
    "case": {
      "tabs": {
        "case_study": "Newly bereaved spouse needing emotional support",
        "vitals": "N/A - bereavement support",
        "labs": "N/A",
        "nursing_actions": "Therapeutic communication, acknowledge grief, offer presence and resources",
        "md_orders": "N/A - postmortem care complete"
      }
    }
  },
  {
    "id": "CB-2026-035",
    "bank": "Compass B",
    "system": "End-of-Life/Palliative Care",
    "topic": "Hospice Planning",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with end-stage lung cancer is being discharged to home hospice. Which statement by the family indicates understanding of hospice care?",
    "choices": [
      "Hospice will provide treatment to cure my father's cancer",
      "We can call hospice nurses 24 hours a day for help",
      "Hospice care is only for the last few days of life",
      "Dad will have to go to an inpatient facility for hospice care"
    ],
    "answer": "We can call hospice nurses 24 hours a day for help",
    "rationale": "Hospice provides: 24/7 on-call support, comfort care (not curative), symptom management, family support. Can be provided at home OR facility. Not just for last days - can be months if prognosis <6 months. Focus is quality of life and comfort, not cure.",
    "case": {
      "tabs": {
        "case_study": "Terminal cancer patient transitioning to home hospice",
        "vitals": "Stable on current pain management",
        "labs": "Not applicable - comfort care focus",
        "nursing_actions": "Hospice education, ensure family understands services",
        "md_orders": "Home hospice referral, comfort medications"
      }
    }
  },
  {
    "id": "CB-2026-036",
    "bank": "Compass B",
    "system": "End-of-Life/Palliative Care",
    "topic": "Death and Dying Cultural",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client from a culture that values large family presence at death is dying. The unit has a policy of only 2 visitors at a time. What should the nurse do?",
    "choices": [
      "Strictly enforce the 2-visitor policy to maintain unit order",
      "Work with the family to accommodate more visitors during this time",
      "Explain that hospital policy cannot be changed",
      "Move the family to a waiting room to control visitor numbers"
    ],
    "answer": "Work with the family to accommodate more visitors during this time",
    "rationale": "End-of-life care requires cultural sensitivity and flexibility. Work with charge nurse/manager to accommodate family needs during dying process when possible. Policy exists but compassion and cultural needs should be considered. Don't rigidly enforce rules at time of death. Balance family needs with patient care.",
    "case": {
      "tabs": {
        "case_study": "Dying client with cultural needs for large family presence",
        "vitals": "Actively dying, family gathered",
        "labs": "N/A",
        "nursing_actions": "Cultural sensitivity, flexible visiting, support family",
        "md_orders": "Comfort care only"
      }
    }
  },
  {
    "id": "CB-2026-037",
    "bank": "Compass B",
    "system": "End-of-Life/Palliative Care",
    "topic": "Cancer Pain Management",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with terminal cancer reports pain level 8/10 despite around-the-clock morphine. Which intervention is most appropriate?",
    "choices": [
      "Encourage the client to use distraction techniques instead of more medication",
      "Wait 4 hours until the next scheduled morphine dose",
      "Contact the provider for breakthrough pain medication orders",
      "Explain that the client may be developing addiction to opioids"
    ],
    "answer": "Contact the provider for breakthrough pain medication orders",
    "rationale": "Terminal cancer pain management: scheduled long-acting opioids PLUS breakthrough medication for uncontrolled pain. Pain 8/10 needs immediate attention. Don't wait. Distraction is adjunct, not replacement. Addiction not a concern in terminal illness - comfort is priority. Aggressive pain management is appropriate and necessary.",
    "case": {
      "tabs": {
        "case_study": "Terminal cancer patient with uncontrolled pain needing breakthrough meds",
        "vitals": "Tachycardic from pain, BP elevated",
        "labs": "N/A",
        "nursing_actions": "Contact provider for breakthrough orders, reassess pain after intervention",
        "md_orders": "Morphine SR 30mg q12h scheduled, need PRN breakthrough"
      }
    }
  },
  {
    "id": "CB-2026-038",
    "bank": "Compass B",
    "system": "Psych/Mental Health",
    "topic": "Hallucinations Management",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with schizophrenia tells the nurse, I hear voices telling me to hurt myself. What is the nurse's priority response?",
    "choices": [
      "Tell the client that the voices are not real and to ignore them",
      "Ask the client if they have a plan to harm themselves",
      "Encourage the client to describe what the voices are saying",
      "Explain to the client that the voices are caused by their illness"
    ],
    "answer": "Ask the client if they have a plan to harm themselves",
    "rationale": "Command hallucinations to harm self = safety risk. FIRST assess for suicidal plan/intent. Then provide safety (one-to-one observation, remove harmful objects), notify provider, administer PRN medication. Don't argue about reality of voices. Don't encourage elaboration. Safety assessment is priority.",
    "case": {
      "tabs": {
        "case_study": "Schizophrenia patient with command hallucinations - safety priority",
        "vitals": "Anxious, responding to internal stimuli",
        "labs": "Antipsychotic levels being checked",
        "nursing_actions": "Safety assessment, suicide precautions, notify provider",
        "md_orders": "One-to-one observation, PRN antipsychotic available"
      }
    }
  },
  {
    "id": "CB-2026-039",
    "bank": "Compass B",
    "system": "Psych/Mental Health",
    "topic": "Schizophrenia Intervention",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with schizophrenia is pacing in the hallway and shouting at other clients. Which intervention should the nurse implement first?",
    "choices": [
      "Place the client in restraints to protect other clients",
      "Direct the client to a quiet area away from others",
      "Administer PRN haloperidol IM immediately",
      "Call security to remove the client from the unit"
    ],
    "answer": "Direct the client to a quiet area away from others",
    "rationale": "De-escalation sequence: (1) reduce stimulation (quiet area), (2) verbal de-escalation (calm, clear communication), (3) PRN medication if needed, (4) restraints as absolute last resort. Never start with most restrictive intervention. Remove from stimulating environment first, give space, use calm approach.",
    "case": {
      "tabs": {
        "case_study": "Agitated schizophrenia client requiring de-escalation",
        "vitals": "Agitated, pacing, yelling",
        "labs": "N/A",
        "nursing_actions": "De-escalation: quiet environment, calm approach, PRN meds if needed",
        "md_orders": "PRN haloperidol 5mg IM for agitation"
      }
    }
  },
  {
    "id": "CB-2026-040",
    "bank": "Compass B",
    "system": "Psych/Mental Health",
    "topic": "Depression Assessment",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with major depressive disorder states, Everyone would be better off without me. Which response by the nurse is most appropriate?",
    "choices": [
      "You shouldn't think that way, your family loves you",
      "Are you thinking about harming yourself?",
      "Let's talk about why you feel this way",
      "Things always seem worse before they get better"
    ],
    "answer": "Are you thinking about harming yourself?",
    "rationale": "Everyone better off without me = suicidal ideation. DIRECTLY ask about suicide - asking doesn't plant the idea. Assess plan, intent, means. Don't minimize ('shouldn't think that'), don't use cliches ('things get better'), don't delay assessment by exploring feelings first. Safety assessment is immediate priority.",
    "case": {
      "tabs": {
        "case_study": "Depressed client with suicidal ideation requiring safety assessment",
        "vitals": "Withdrawn, flat affect, poor eye contact",
        "labs": "N/A",
        "nursing_actions": "Suicide risk assessment, safety plan, notify provider",
        "md_orders": "Depression precautions, monitor closely"
      }
    }
  },
  {
    "id": "CB-2026-041",
    "bank": "Compass B",
    "system": "Psych/Mental Health",
    "topic": "Therapeutic Communication",
    "difficulty": 5,
    "qtype": "single",
    "stem": "An anxious client says, I'm so worried about my test results. Which response demonstrates therapeutic communication?",
    "choices": [
      "Don't worry, I'm sure everything will be fine",
      "Tell me more about what's worrying you",
      "You shouldn't think about it until the results come back",
      "Everyone feels anxious about test results"
    ],
    "answer": "Tell me more about what's worrying you",
    "rationale": "Therapeutic communication techniques: open-ended questions, exploring feelings, active listening. 'Tell me more' encourages expression. Don't give false reassurance ('don't worry, sure it'll be fine'), don't minimize ('everyone feels that way'), don't tell client what to do ('shouldn't think about it'). Encourage discussion.",
    "case": {
      "tabs": {
        "case_study": "Anxious client needing emotional support",
        "vitals": "Tachycardic, restless",
        "labs": "Awaiting test results",
        "nursing_actions": "Therapeutic communication, assess anxiety level, provide support",
        "md_orders": "N/A"
      }
    }
  },
  {
    "id": "CB-2026-042",
    "bank": "Compass B",
    "system": "Psych/Mental Health",
    "topic": "Substance Withdrawal",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client admitted for alcohol withdrawal is tremulous, diaphoretic, and reports seeing bugs crawling on the walls. What is the priority nursing action?",
    "choices": [
      "Reassure the client that the bugs are not real",
      "Administer prescribed benzodiazepine immediately",
      "Restrain the client to prevent injury from hallucinations",
      "Dim the lights and provide a quiet environment"
    ],
    "answer": "Administer prescribed benzodiazepine immediately",
    "rationale": "Visual hallucinations + tremors + diaphoresis = severe alcohol withdrawal/delirium tremens. Life-threatening. Priority: benzodiazepine (prevents seizures, reduces agitation). Then quiet environment, reality orientation, seizure precautions. Don't restrain (increases agitation). DTs can be fatal without treatment. Medication is priority.",
    "case": {
      "tabs": {
        "case_study": "Alcohol withdrawal with hallucinations requiring immediate medication",
        "vitals": "BP 168/96, HR 124, tremulous, diaphoretic",
        "labs": "CIWA score elevated",
        "nursing_actions": "Administer benzos, seizure precautions, monitor vitals",
        "md_orders": "Lorazepam per CIWA protocol, thiamine, folate, multivitamin"
      }
    }
  },
  {
    "id": "CB-2026-043",
    "bank": "Compass B",
    "system": "Pharmacology",
    "topic": "Vancomycin Adverse Reaction",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client receiving IV vancomycin suddenly develops flushing of the face and neck, hypotension, and tachycardia. What should the nurse recognize?",
    "choices": [
      "Anaphylactic reaction requiring epinephrine",
      "Red man syndrome from rapid vancomycin infusion",
      "Therapeutic response to the antibiotic",
      "Sign of vancomycin toxicity requiring dialysis"
    ],
    "answer": "Red man syndrome from rapid vancomycin infusion",
    "rationale": "Red man syndrome (vancomycin flushing syndrome): flushing, pruritus, hypotension, tachycardia from RAPID infusion (histamine release, not allergy). STOP infusion, when symptoms resolve restart at SLOWER rate. Not anaphylaxis (no airway involvement). Prevention: infuse over at least 60 minutes. Can premedicate with antihistamine.",
    "case": {
      "tabs": {
        "case_study": "Client experiencing red man syndrome from vancomycin",
        "vitals": "BP 92/58 (was 128/76), HR 118, facial flushing",
        "labs": "Vanco trough pending",
        "nursing_actions": "Stop infusion, restart slowly when symptoms resolve",
        "md_orders": "Vancomycin 1g IV q12h - infuse over 60-90 minutes"
      }
    }
  },
  {
    "id": "CB-2026-044",
    "bank": "Compass B",
    "system": "Pharmacology",
    "topic": "IM Injection Calculation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The provider orders meperidine 75 mg IM. Available: meperidine 100 mg/mL. How many mL should the nurse administer?",
    "choices": [
      "0.5 mL",
      "0.75 mL",
      "1.0 mL",
      "1.5 mL"
    ],
    "answer": "0.75 mL",
    "rationale": "Dose calculation: (Desired dose / Available dose) x Volume = (75 mg / 100 mg) x 1 mL = 0.75 mL. Always use this formula for medication calculations. Double-check math. Have another nurse verify high-risk medications.",
    "case": {
      "tabs": {
        "case_study": "Medication calculation for IM injection",
        "vitals": "N/A",
        "labs": "N/A",
        "nursing_actions": "Calculate correct dose, verify calculation",
        "md_orders": "Meperidine 75mg IM q4h PRN pain"
      }
    }
  },
  {
    "id": "CB-2026-045",
    "bank": "Compass B",
    "system": "Pharmacology",
    "topic": "GT Feeding Calculation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client is receiving continuous gastrostomy tube feeding at 75 mL/hour for 16 hours daily. How many total mL will the client receive in 24 hours?",
    "choices": [
      "1,200 mL",
      "1,800 mL",
      "1,200 mL over 16 hours, 0 mL remaining 8 hours",
      "75 mL"
    ],
    "answer": "1,200 mL over 16 hours, 0 mL remaining 8 hours",
    "rationale": "75 mL/hr x 16 hours = 1,200 mL total. Question asks total in 24 hours but feeding only runs 16 hours. Total received = 1,200 mL. Common for continuous feeds to run 16-20 hours (not full 24) to allow time for meds, stomach rest, activities.",
    "case": {
      "tabs": {
        "case_study": "Client on continuous gastrostomy tube feeding",
        "vitals": "Stable, tolerating feeds",
        "labs": "N/A",
        "nursing_actions": "Monitor feeding tolerance, check residuals",
        "md_orders": "Tube feeding 75 mL/hr x 16 hours daily"
      }
    }
  },
  {
    "id": "CB-2026-046",
    "bank": "Compass B",
    "system": "Pharmacology",
    "topic": "Medication Timing",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client is prescribed levothyroxine 100 mcg PO daily. What is the best time for the nurse to administer this medication?",
    "choices": [
      "With breakfast to prevent stomach upset",
      "At bedtime for better absorption",
      "30-60 minutes before breakfast on an empty stomach",
      "With lunch when the client is most alert"
    ],
    "answer": "30-60 minutes before breakfast on an empty stomach",
    "rationale": "Levothyroxine (thyroid hormone): take 30-60 minutes BEFORE breakfast on empty stomach for best absorption. Don't take with food, calcium, iron, or antacids (decrease absorption). Same time daily for consistent levels. Morning dosing preferred (mimics natural thyroid hormone pattern).",
    "case": {
      "tabs": {
        "case_study": "Client with hypothyroidism on levothyroxine replacement",
        "vitals": "Stable",
        "labs": "TSH being monitored for dose adjustment",
        "nursing_actions": "Teach proper medication timing for optimal absorption",
        "md_orders": "Levothyroxine 100 mcg PO daily before breakfast"
      }
    }
  },
  {
    "id": "CB-2026-047",
    "bank": "Compass B",
    "system": "Neurologic",
    "topic": "Parkinson's Disease",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is caring for a client with Parkinson's disease. Which finding would the nurse expect during assessment?",
    "choices": [
      "Intention tremor that worsens with purposeful movement",
      "Resting tremor that decreases with voluntary movement",
      "Hyperactive deep tendon reflexes bilaterally",
      "Sudden, jerky, uncontrollable movements"
    ],
    "answer": "Resting tremor that decreases with voluntary movement",
    "rationale": "Parkinson's classic triad: resting tremor (pill-rolling, decreases with movement), rigidity (cogwheel), bradykinesia (slow movement). NOT intention tremor (cerebellar). DTRs normal or decreased. Sudden jerky movements = chorea (Huntington's). Parkinson's = resting tremor that IMPROVES with purposeful action.",
    "case": {
      "tabs": {
        "case_study": "Client with Parkinson's showing classic symptoms",
        "vitals": "Stable",
        "labs": "N/A - clinical diagnosis",
        "nursing_actions": "Safety assessment, fall prevention, assess ADL ability",
        "md_orders": "Carbidopa-levodopa, fall precautions, PT/OT consults"
      }
    }
  },
  {
    "id": "CB-2026-048",
    "bank": "Compass B",
    "system": "Neurologic",
    "topic": "Seizure Medication",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client taking phenytoin (Dilantin) for seizures should be instructed about which important side effect?",
    "choices": [
      "Hypoglycemia requiring frequent blood glucose monitoring",
      "Gingival hyperplasia requiring good oral hygiene",
      "Severe constipation requiring stool softeners",
      "Excessive urination requiring fluid restriction"
    ],
    "answer": "Gingival hyperplasia requiring good oral hygiene",
    "rationale": "Phenytoin side effects: gingival hyperplasia (gum overgrowth - need excellent oral care, regular dental visits), hirsutism, diplopia, ataxia, nystagmus. Also causes drug interactions (many), don't stop abruptly (seizures), therapeutic level 10-20. Not hypoglycemia, constipation, or polyuria.",
    "case": {
      "tabs": {
        "case_study": "Client on long-term phenytoin for seizure disorder",
        "vitals": "Stable, seizure-free",
        "labs": "Phenytoin level therapeutic at 14",
        "nursing_actions": "Teach side effects, emphasize oral hygiene, check drug levels",
        "md_orders": "Phenytoin 300mg PO daily, level checks q6 months"
      }
    }
  },
  {
    "id": "CB-2026-049",
    "bank": "Compass B",
    "system": "Neurologic",
    "topic": "CVA Anosognosia",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client who had a right-sided stroke denies having any weakness on the left side despite obvious left-sided paralysis. What term describes this?",
    "choices": [
      "Aphasia - inability to communicate verbally",
      "Apraxia - inability to perform learned movements",
      "Agnosia - inability to recognize familiar objects",
      "Anosognosia - denial/lack of awareness of deficits"
    ],
    "answer": "Anosognosia - denial/lack of awareness of deficits",
    "rationale": "Anosognosia (right hemisphere stroke): unawareness/denial of deficits, lack of insight into disabilities. Client truly doesn't perceive the problem (not psychological denial). Increases safety risk - may try to walk despite paralysis. Need constant supervision. Aphasia=language, apraxia=motor planning, agnosia=recognition.",
    "case": {
      "tabs": {
        "case_study": "Right hemisphere CVA with anosognosia and left-sided neglect",
        "vitals": "Stable, left hemiplegia present",
        "labs": "CT confirmed right hemisphere stroke",
        "nursing_actions": "Safety measures, does not perceive deficits - high fall risk",
        "md_orders": "Strict fall precautions, PT/OT for left-sided deficits"
      }
    }
  },
  {
    "id": "CB-2026-050",
    "bank": "Compass B",
    "system": "Neurologic",
    "topic": "Cranial Nerve Assessment",
    "difficulty": 5,
    "qtype": "single",
    "stem": "To assess cranial nerve VII (facial nerve), the nurse should ask the client to perform which action?",
    "choices": [
      "Stick out the tongue and move it side to side",
      "Smile and show the teeth",
      "Shrug the shoulders against resistance",
      "Follow the nurse's finger with the eyes"
    ],
    "answer": "Smile and show the teeth",
    "rationale": "Cranial nerve VII (facial): smile, show teeth, close eyes tightly, puff out cheeks. Tests facial movement/expression. CN XII=stick out tongue. CN XI=shoulder shrug. CN III, IV, VI=extraocular movements. Facial nerve palsy (Bell's palsy) affects CN VII.",
    "case": {
      "tabs": {
        "case_study": "Client requiring cranial nerve assessment",
        "vitals": "Stable",
        "labs": "N/A",
        "nursing_actions": "Systematic cranial nerve examination",
        "md_orders": "Neuro assessment q4h"
      }
    }
  }
]