[
  {
    "id": "CA-2026-001",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Acute Myocardial Infarction",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is caring for a 68-year-old client admitted 2 hours ago with crushing substernal chest pain. The client suddenly becomes bradycardic with BP 82/50 (was 128/76), HR 42 (was 88). ECG shows ST elevation in leads II, III, aVF with new second-degree AV block type II. Which action should the nurse take first?",
    "choices": [
      "Administer prescribed nitroglycerin 0.4 mg sublingual for chest pain relief",
      "Apply transcutaneous pacing pads and prepare to initiate pacing",
      "Place the client in Trendelenburg position to improve blood pressure",
      "Administer atropine 0.5 mg IV push to increase the heart rate"
    ],
    "answer": "Apply transcutaneous pacing pads and prepare to initiate pacing",
    "rationale": "Second-degree AV block type II with hemodynamic instability requires immediate pacing. Type II blocks are infranodal and can suddenly progress to complete heart block. Atropine is ineffective for type II blocks. Nitroglycerin is contraindicated in RV infarction (inferior MI). Trendelenburg does not address the rhythm problem.",
    "case": {
      "tabs": {
        "case_study": "68M with acute inferior STEMI complicated by unstable second-degree AV block type II",
        "vitals": "BP 82/50, HR 42, RR 24, SpO2 92% on 2L NC",
        "labs": "Troponin I 3.8 ng/mL, ECG: ST elevation II/III/aVF with 2° AV block type II",
        "nursing_actions": "Continuous telemetry, large-bore IV x2, oxygen 2L NC",
        "md_orders": "ASA 325mg given, HOLD NTG, heparin infusion, cath lab STAT"
      }
    }
  },
  {
    "id": "CA-2026-002",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Dysrhythmias",
    "difficulty": 5,
    "qtype": "single",
    "stem": "After noting a pulse deficit when assessing a 74-year-old client who has just arrived in the emergency department, which action should the nurse anticipate?",
    "choices": [
      "Emergent cardioversion will be performed",
      "A cardiac catheterization will be scheduled",
      "Electrocardiographic (ECG) monitoring will be initiated",
      "A stress test will be ordered"
    ],
    "answer": "Electrocardiographic (ECG) monitoring will be initiated",
    "rationale": "A pulse deficit indicates irregular heart rhythm, most commonly atrial fibrillation. ECG monitoring is needed to identify and document the dysrhythmia. Cardioversion may follow but is not immediate. Catheterization and stress testing are not next steps for dysrhythmia identification.",
    "case": {
      "tabs": {
        "case_study": "74-year-old with newly identified pulse deficit suggesting atrial fibrillation",
        "vitals": "Apical 92 irregular, Radial 76, BP 142/88, RR 18, SpO2 96% RA",
        "labs": "Pending - 12-lead ECG needed",
        "nursing_actions": "Pulse deficit noted, continuous monitoring initiated",
        "md_orders": "12-lead ECG STAT, telemetry, cardiac enzymes"
      }
    }
  },
  {
    "id": "CA-2026-003",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Heart Failure",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 78-year-old client with heart failure (EF 25%) presents with severe dyspnea, pink frothy sputum, BP 180/110, HR 124, RR 34, SpO2 84% on room air. Which medication should the nurse prepare to administer first?",
    "choices": [
      "Furosemide 40 mg IV push",
      "Metoprolol 5 mg IV push",
      "Digoxin 0.25 mg IV",
      "Lisinopril 10 mg PO"
    ],
    "answer": "Furosemide 40 mg IV push",
    "rationale": "Acute pulmonary edema requires immediate diuresis. Furosemide IV acts within minutes. Beta-blockers worsen acute HF. Digoxin takes hours. Oral ACE inhibitor is too slow for acute emergency.",
    "case": {
      "tabs": {
        "case_study": "78F with acute decompensated heart failure and flash pulmonary edema",
        "vitals": "BP 180/110, HR 124, RR 34 labored, SpO2 84% RA",
        "labs": "BNP 2,850, CXR: bilateral infiltrates",
        "nursing_actions": "High-flow O2, upright position, continuous monitoring",
        "md_orders": "Furosemide 40mg IV now, NTG IV infusion, morphine PRN"
      }
    }
  },
  {
    "id": "CA-2026-004",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Hypertensive Crisis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 52-year-old client presents to the emergency department with BP 210/124, severe headache, blurred vision, and nausea. The client reports running out of blood pressure medications 1 week ago. Which action is the priority?",
    "choices": [
      "Administer sublingual nifedipine to rapidly lower blood pressure",
      "Start IV labetalol infusion per hypertensive emergency protocol",
      "Give oral clonidine and recheck BP in 30 minutes",
      "Obtain CT scan of head to rule out intracranial hemorrhage"
    ],
    "answer": "Start IV labetalol infusion per hypertensive emergency protocol",
    "rationale": "Hypertensive emergency (BP >180/120 with end-organ symptoms) requires controlled gradual BP reduction with IV medications. Labetalol IV allows titration. Sublingual nifedipine causes unpredictable rapid drops. Oral medications too slow. CT may be needed but BP control is priority.",
    "case": {
      "tabs": {
        "case_study": "52M with hypertensive emergency after medication non-compliance",
        "vitals": "BP 210/124, HR 96, RR 20, SpO2 97% RA, severe headache",
        "labs": "Creatinine 1.9 (baseline 1.1), urinalysis: proteinuria",
        "nursing_actions": "Large-bore IV access, continuous BP monitoring",
        "md_orders": "Labetalol IV infusion, reduce BP by 25% over first hour, neuro checks q15min"
      }
    }
  },
  {
    "id": "CA-2026-005",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Cardiac Assessment",
    "difficulty": 5,
    "qtype": "single",
    "stem": "During a physical examination of a 74-year-old client, the nurse palpates the point of maximal impulse (PMI) in the sixth intercostal space lateral to the left midclavicular line. Which action should the nurse take next?",
    "choices": [
      "Ask the client about risk factors for atherosclerosis",
      "Document that the PMI is in the normal anatomic location",
      "Auscultate both carotid arteries for the presence of a bruit",
      "Assess the client for symptoms of left ventricular hypertrophy"
    ],
    "answer": "Assess the client for symptoms of left ventricular hypertrophy",
    "rationale": "Normal PMI is at 5th intercostal space at midclavicular line. PMI displaced laterally and inferiorly indicates left ventricular enlargement/hypertrophy. The nurse should assess for associated symptoms such as dyspnea, fatigue, syncope.",
    "case": {
      "tabs": {
        "case_study": "74-year-old with laterally displaced PMI suggesting LV enlargement",
        "vitals": "BP 158/92, HR 78 regular, RR 16, SpO2 96% RA",
        "labs": "ECG and echocardiogram pending to evaluate LV function",
        "nursing_actions": "Complete cardiovascular assessment, symptom evaluation",
        "md_orders": "12-lead ECG, echocardiogram, BNP level"
      }
    }
  },
  {
    "id": "CA-2026-006",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Heart Failure Monitoring",
    "difficulty": 5,
    "qtype": "single",
    "stem": "To determine the effects of therapy for a client who is being treated for heart failure, which laboratory result will the nurse plan to review?",
    "choices": [
      "Troponin",
      "Homocysteine (Hcy)",
      "Low-density lipoprotein (LDL)",
      "B-type natriuretic peptide (BNP)"
    ],
    "answer": "B-type natriuretic peptide (BNP)",
    "rationale": "BNP is released in response to ventricular stretch and correlates with heart failure severity. It's used to monitor treatment effectiveness. Troponin indicates myocardial damage, not HF status. Homocysteine and LDL relate to CAD risk, not acute HF management.",
    "case": {
      "tabs": {
        "case_study": "Client with heart failure being treated with diuretics and ACE inhibitors",
        "vitals": "BP 128/76, HR 82, RR 18, SpO2 96% on 2L NC",
        "labs": "Baseline BNP 1,850, follow-up needed to assess treatment response",
        "nursing_actions": "Daily weights, I&O monitoring, symptom assessment",
        "md_orders": "Repeat BNP in AM, continue furosemide 40mg PO BID, lisinopril 10mg daily"
      }
    }
  },
  {
    "id": "CA-2026-007",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Jugular Venous Distention",
    "difficulty": 5,
    "qtype": "single",
    "stem": "While assessing a client who was admitted with heart failure, the nurse notes jugular venous distention (JVD) when the client is lying flat in bed. Which action should the nurse take next?",
    "choices": [
      "Document this as an expected finding in heart failure",
      "Raise the head of the bed to 45 degrees and reassess for JVD",
      "Notify the healthcare provider about this abnormal finding",
      "Prepare to administer an IV fluid bolus for hypovolemia"
    ],
    "answer": "Raise the head of the bed to 45 degrees and reassess for JVD",
    "rationale": "JVD is normally visible when lying flat. The proper assessment technique is to elevate HOB to 30-45 degrees. JVD visible at 45 degrees indicates elevated central venous pressure from right-sided heart failure. If present at 45 degrees, then document and notify provider.",
    "case": {
      "tabs": {
        "case_study": "Client with heart failure requiring proper JVD assessment technique",
        "vitals": "BP 136/82, HR 88, RR 20, SpO2 94% on 2L NC",
        "labs": "BNP 980, chest X-ray shows cardiomegaly",
        "nursing_actions": "Cardiovascular assessment in progress",
        "md_orders": "Furosemide 20mg PO daily, low-sodium diet, daily weights"
      }
    }
  },
  {
    "id": "CA-2026-008",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Anticoagulation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 67-year-old client with atrial fibrillation has been taking warfarin for 6 months. Today's INR is 5.2 (therapeutic range 2-3). The client denies any bleeding. Which action should the nurse anticipate?",
    "choices": [
      "Administer vitamin K 10 mg IV immediately",
      "Hold the next dose of warfarin and recheck INR in 24 hours",
      "Administer protamine sulfate 50 mg IV",
      "Transfuse 2 units of fresh frozen plasma (FFP)"
    ],
    "answer": "Hold the next dose of warfarin and recheck INR in 24 hours",
    "rationale": "INR 5.2 without bleeding is managed by holding warfarin and monitoring. Vitamin K (PO or IV) reserved for INR >9 or active bleeding. IV vitamin K can cause anaphylaxis and prolonged warfarin resistance. Protamine reverses heparin, not warfarin. FFP reserved for serious bleeding.",
    "case": {
      "tabs": {
        "case_study": "67M with atrial fibrillation on warfarin with elevated INR but no bleeding",
        "vitals": "BP 142/86, HR 78 irregular, RR 16, SpO2 97% RA",
        "labs": "INR 5.2 (was 2.8 last week), Hgb 13.2, platelets 220K, no bleeding noted",
        "nursing_actions": "Assess for signs of bleeding, monitor vital signs",
        "md_orders": "Hold warfarin tonight, recheck INR tomorrow AM, resume warfarin at lower dose if INR <3"
      }
    }
  },
  {
    "id": "CA-2026-009",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Peripheral Vascular Disease",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 72-year-old client with peripheral arterial disease (PAD) reports cramping pain in both calves when walking two blocks that is relieved by rest. Which instruction should the nurse include in the teaching plan?",
    "choices": [
      "Elevate legs above heart level when resting to improve arterial blood flow",
      "Apply warm heating pads to calves for 20 minutes before walking",
      "Walk until pain occurs, rest until it subsides, then resume walking",
      "Perform ankle pumps and leg exercises while lying in bed"
    ],
    "answer": "Walk until pain occurs, rest until it subsides, then resume walking",
    "rationale": "This describes intermittent claudication from PAD. Exercise therapy (walk-rest-walk) is first-line treatment—it stimulates collateral circulation. Elevating legs WORSENS arterial insufficiency (gravity works against arterial flow). Heat increases metabolic demand without improving supply. Ankle pumps are for venous disease, not arterial.",
    "case": {
      "tabs": {
        "case_study": "72M with PAD and intermittent claudication requiring lifestyle modifications",
        "vitals": "BP 148/88, HR 76, bilateral pedal pulses 1+ and weak",
        "labs": "ABI: right 0.68, left 0.72 (abnormal <0.9), lipid panel elevated",
        "nursing_actions": "Patient education on PAD management and risk factor modification",
        "md_orders": "Supervised exercise program, cilostazol 100mg BID, statin therapy, smoking cessation"
      }
    }
  },
  {
    "id": "CA-2026-010",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Pacemaker",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 81-year-old client had a permanent pacemaker inserted 2 days ago for complete heart block. The client asks about activities at home. Which statement by the nurse is most appropriate?",
    "choices": [
      "You can resume all normal activities including golf and tennis immediately",
      "Avoid lifting the affected arm above shoulder level for 4-6 weeks",
      "Sleep only on your right side to prevent pressure on the pacemaker",
      "You will need to avoid all electromagnetic devices including microwaves"
    ],
    "answer": "Avoid lifting the affected arm above shoulder level for 4-6 weeks",
    "rationale": "After pacemaker insertion, avoid raising affected arm above shoulder for 4-6 weeks to prevent lead dislodgement. Gradual return to activities is appropriate. Can sleep in any comfortable position. Modern pacemakers are shielded from most household electromagnetic devices. MRI and arc welding remain contraindicated.",
    "case": {
      "tabs": {
        "case_study": "81F status post permanent pacemaker insertion for complete heart block",
        "vitals": "BP 128/72, paced rhythm 70 bpm, SpO2 96% RA, incision clean/dry/intact",
        "labs": "Pacemaker interrogation shows appropriate sensing and capture",
        "nursing_actions": "Discharge teaching on pacemaker precautions and follow-up",
        "md_orders": "Arm sling PRN comfort, follow-up in 1 week, pacemaker check in 1 month"
      }
    }
  },
  {
    "id": "CA-2026-011",
    "bank": "Compass A",
    "system": "Respiratory",
    "topic": "COPD Exacerbation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 71-year-old client with COPD is admitted with acute exacerbation. Vitals: BP 146/88, HR 108, RR 32, SpO2 84% on room air. ABG: pH 7.28, PaCO2 68, PaO2 52, HCO3 28. Which oxygen delivery method is most appropriate?",
    "choices": [
      "Non-rebreather mask at 15 L/min to rapidly correct hypoxemia",
      "Nasal cannula at 6 L/min to achieve SpO2 of 95-100%",
      "Venturi mask at 28% FiO2 to achieve SpO2 of 88-92%",
      "Simple face mask at 10 L/min until symptoms improve"
    ],
    "answer": "Venturi mask at 28% FiO2 to achieve SpO2 of 88-92%",
    "rationale": "COPD with chronic CO2 retention (PaCO2 68, pH 7.28) requires controlled low-flow oxygen. Venturi mask provides precise FiO2. Target SpO2 88-92% in chronic hypercapnia to avoid suppressing hypoxic drive. High-flow oxygen can worsen CO2 retention and cause respiratory depression.",
    "case": {
      "tabs": {
        "case_study": "71M with COPD exacerbation and acute-on-chronic respiratory failure with CO2 retention",
        "vitals": "BP 146/88, HR 108, RR 32 labored, SpO2 84% RA, Temp 100.8°F",
        "labs": "ABG: pH 7.28, PaCO2 68, PaO2 52, HCO3 28; WBC 14.2; CXR: hyperinflation",
        "nursing_actions": "High Fowler's position, pursed-lip breathing encouraged",
        "md_orders": "Venturi 28% targeting SpO2 88-92%, albuterol/ipratropium nebs q4h, methylprednisolone 125mg IV, azithromycin"
      }
    }
  },
  {
    "id": "CA-2026-012",
    "bank": "Compass A",
    "system": "Respiratory",
    "topic": "Acute Respiratory Distress",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is caring for a client with acute shortness of breath who was just admitted to the hospital. Which action should the nurse take during the initial assessment?",
    "choices": [
      "Ask the client to lie down to complete a full physical assessment",
      "Briefly ask specific questions about this episode of respiratory distress",
      "Complete the admission database to check for allergies before treatment",
      "Delay the physical assessment to first complete pulmonary function tests"
    ],
    "answer": "Briefly ask specific questions about this episode of respiratory distress",
    "rationale": "With acute respiratory distress, perform focused assessment of immediate problem. Asking client to lie flat worsens dyspnea. Full admission database can wait until client is stable. Pulmonary function tests are not emergency interventions and cannot be done during acute distress.",
    "case": {
      "tabs": {
        "case_study": "Client with acute dyspnea requiring immediate focused assessment",
        "vitals": "RR 28, SpO2 88% on RA, using accessory muscles",
        "labs": "Pending",
        "nursing_actions": "Upright positioning, oxygen applied, focused respiratory assessment",
        "md_orders": "Oxygen to maintain SpO2 >90%, stat CXR, ABG, CBC"
      }
    }
  },
  {
    "id": "CA-2026-013",
    "bank": "Compass A",
    "system": "Respiratory",
    "topic": "Thoracentesis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is preparing a client with a left-sided pleural effusion for a thoracentesis. How should the nurse position the client?",
    "choices": [
      "Supine with the head of the bed elevated 30 degrees",
      "In a high-Fowler's position with the left arm extended",
      "On the right side with the left arm extended above the head",
      "Sitting upright with arms supported on an over-bed table"
    ],
    "answer": "Sitting upright with arms supported on an over-bed table",
    "rationale": "Proper thoracentesis positioning: sitting upright, leaning forward, arms/head supported on over-bed table. This position separates ribs maximally and allows access to pleural space. Lying positions do not provide adequate access for needle insertion.",
    "case": {
      "tabs": {
        "case_study": "Client with large left pleural effusion requiring thoracentesis",
        "vitals": "RR 24, SpO2 91% on 2L NC, decreased breath sounds left base",
        "labs": "CXR: large left pleural effusion, blunted costophrenic angle",
        "nursing_actions": "Position for procedure, monitor vital signs, explain procedure",
        "md_orders": "Thoracentesis at bedside, send pleural fluid for cell count, culture, cytology"
      }
    }
  },
  {
    "id": "CA-2026-014",
    "bank": "Compass A",
    "system": "Respiratory",
    "topic": "Lung Sounds",
    "difficulty": 5,
    "qtype": "single",
    "stem": "On auscultation of a client's lungs, the nurse hears low-pitched, bubbling sounds during inhalation in the lower third of both lungs. How should the nurse document this finding?",
    "choices": [
      "Inspiratory crackles at the bases",
      "Expiratory wheezes in both lungs",
      "Abnormal lung sounds in the apices of both lungs",
      "Pleural friction rub in the right and left lower lobes"
    ],
    "answer": "Inspiratory crackles at the bases",
    "rationale": "Low-pitched, bubbling sounds on inspiration = crackles (also called rales). Heard at lung bases suggests fluid, atelectasis, or pneumonia. Wheezes are continuous musical sounds on expiration. Friction rub is grating sound throughout respiratory cycle. Location is bases, not apices.",
    "case": {
      "tabs": {
        "case_study": "Client with bilateral basilar crackles requiring assessment for underlying cause",
        "vitals": "RR 20, SpO2 93% on RA, no dyspnea at rest",
        "labs": "CXR pending to evaluate for infiltrates or fluid",
        "nursing_actions": "Auscultate all lung fields, assess for signs of heart failure or pneumonia",
        "md_orders": "CXR PA and lateral, BNP if HF suspected"
      }
    }
  },
  {
    "id": "CA-2026-015",
    "bank": "Compass A",
    "system": "Respiratory",
    "topic": "Pneumonia",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 68-year-old client with bacterial pneumonia has bronchial breath sounds auscultated between the scapulae and a temperature of 103.3°F (39.6°C). Which action should the nurse take?",
    "choices": [
      "Document the findings as expected for pneumonia and continue monitoring",
      "Notify the provider immediately about the abnormal breath sounds",
      "Reposition the client to prevent further consolidation",
      "Increase oxygen flow rate to compensate for decreased gas exchange"
    ],
    "answer": "Document the findings as expected for pneumonia and continue monitoring",
    "rationale": "Bronchial breath sounds (normally heard over trachea) heard in lung periphery indicate consolidation—an expected finding in pneumonia. Fever is also expected. These findings should be documented and monitored but are not unexpected emergencies requiring immediate provider notification.",
    "case": {
      "tabs": {
        "case_study": "68F with bacterial pneumonia showing expected consolidation findings",
        "vitals": "Temp 103.3°F, HR 98, RR 22, SpO2 92% on 2L NC",
        "labs": "WBC 17.8, CXR: right lower lobe infiltrate, sputum culture pending",
        "nursing_actions": "Antibiotics administered, antipyretics given, encourage fluids and deep breathing",
        "md_orders": "Ceftriaxone 1g IV q24h, incentive spirometry q1h while awake"
      }
    }
  },
  {
    "id": "CA-2026-016",
    "bank": "Compass A",
    "system": "Respiratory",
    "topic": "Pneumothorax",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 32-year-old client who was in a motor vehicle crash 1 hour ago suddenly develops respiratory distress with tracheal deviation to the left, absent breath sounds on the right, and hypotension. Which action is the priority?",
    "choices": [
      "Prepare for chest tube insertion on the right side",
      "Position client on left side to improve ventilation",
      "Notify the provider to perform needle decompression",
      "Increase oxygen flow rate and obtain stat chest X-ray"
    ],
    "answer": "Notify the provider to perform needle decompression",
    "rationale": "Tracheal deviation + absent breath sounds + hypotension = tension pneumothorax (life-threatening). Requires IMMEDIATE needle decompression (2nd intercostal space, midclavicular line) before chest tube. Cannot wait for X-ray. Left-side positioning does not decompress tension pneumothorax.",
    "case": {
      "tabs": {
        "case_study": "32M with tension pneumothorax after MVA requiring emergent intervention",
        "vitals": "BP 82/50 (dropping), HR 138, RR 36, SpO2 84% on NRB, trachea deviated left",
        "labs": "Absent breath sounds right side, hyperresonance to percussion right",
        "nursing_actions": "Call for provider STAT, prepare needle decompression equipment",
        "md_orders": "Emergency needle decompression right 2nd ICS MCL, followed by chest tube insertion"
      }
    }
  },
  {
    "id": "CA-2026-017",
    "bank": "Compass A",
    "system": "Respiratory",
    "topic": "Asthma Exacerbation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 28-year-old client with asthma arrives in the emergency department with severe dyspnea, inability to speak in full sentences, and no audible wheezing. SpO2 is 88% on room air. Which finding is most concerning?",
    "choices": [
      "Inability to speak in full sentences indicating severe distress",
      "Absence of wheezing suggesting improvement of bronchospasm",
      "Oxygen saturation of 88% requiring supplemental oxygen",
      "Peak flow measurement 40% of personal best"
    ],
    "answer": "Absence of wheezing suggesting improvement of bronchospasm",
    "rationale": "Silent chest (no wheezes) in severe asthma = impending respiratory failure. It means air movement is so severely restricted that wheezing cannot be produced—this is life-threatening and may require intubation. All other findings are concerning but silent chest indicates imminent respiratory arrest.",
    "case": {
      "tabs": {
        "case_study": "28F with severe asthma exacerbation and silent chest indicating respiratory failure",
        "vitals": "HR 132, RR 36 shallow, SpO2 88% RA, unable to speak in sentences, using accessory muscles",
        "labs": "Peak flow 40% personal best, unable to perform full PFTs",
        "nursing_actions": "High-flow O2, prepare for possible intubation, continuous monitoring",
        "md_orders": "Albuterol continuous neb, methylprednisolone 125mg IV, magnesium sulfate 2g IV, prepare for ICU transfer"
      }
    }
  },
  {
    "id": "CA-2026-018",
    "bank": "Compass A",
    "system": "Respiratory",
    "topic": "Mechanical Ventilation",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse has attended a staff education program about caring for clients receiving positive pressure mechanical ventilation. Which statement by the nurse indicates correct understanding?",
    "choices": [
      "Clients should avoid range-of-motion exercises until weaned from ventilation",
      "Clients may develop stress ulcers and gastrointestinal bleeding",
      "Clients will be chemically paralyzed to improve oxygenation",
      "Clients will experience diuresis and polyuria"
    ],
    "answer": "Clients may develop stress ulcers and gastrointestinal bleeding",
    "rationale": "Mechanical ventilation increases risk of stress ulcers due to stress response, decreased perfusion, and acid production. Prophylaxis with H2 blockers or PPIs is standard. ROM should be maintained, not avoided. Paralysis is used selectively, not routinely. Fluid retention (not diuresis) is common.",
    "case": {
      "tabs": {
        "case_study": "Education on mechanical ventilation complications and management",
        "vitals": "N/A - educational scenario",
        "labs": "N/A - knowledge assessment",
        "nursing_actions": "Understanding ventilator-associated complications",
        "md_orders": "Stress ulcer prophylaxis, DVT prophylaxis, daily sedation holidays, spontaneous breathing trials"
      }
    }
  },
  {
    "id": "CA-2026-019",
    "bank": "Compass A",
    "system": "Neurologic",
    "topic": "Acute Ischemic Stroke",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 67-year-old client arrives in the ED with sudden left-sided weakness and slurred speech that began 90 minutes ago. BP is 196/104, HR 88 irregular (atrial fibrillation), NIH Stroke Scale score 12. CT head shows no hemorrhage. What should the nurse do regarding blood pressure before tPA administration?",
    "choices": [
      "Administer labetalol IV immediately to lower BP below 140/90 mmHg",
      "Administer labetalol IV per protocol to reduce BP to less than 185/110 mmHg",
      "Hold all antihypertensives because elevated BP helps maintain cerebral perfusion",
      "Place client in Trendelenburg position to reduce BP naturally"
    ],
    "answer": "Administer labetalol IV per protocol to reduce BP to less than 185/110 mmHg",
    "rationale": "Before tPA, BP must be <185/110 to reduce hemorrhagic transformation risk. Current BP 196/104 exceeds systolic threshold. Labetalol IV carefully lowers BP to <185/110 (NOT normal <140/90 which may compromise cerebral perfusion). After tPA, maintain BP <180/105 for 24 hours.",
    "case": {
      "tabs": {
        "case_study": "67F with acute left MCA stroke within tPA window, BP requires management",
        "vitals": "BP 196/104, HR 88 irregular (AFib), RR 16, SpO2 98% RA, glucose 142",
        "labs": "CT negative for hemorrhage, INR 1.0, aPTT 28, platelets 220K, NIH score 12",
        "nursing_actions": "NPO, IV access, continuous neuro checks q15min, telemetry",
        "md_orders": "tPA 0.9 mg/kg (10% bolus, 90% infusion over 60min), labetalol for BP >185/110, no anticoagulants x24hr"
      }
    }
  },
  {
    "id": "CA-2026-020",
    "bank": "Compass A",
    "system": "Neurologic",
    "topic": "Increased Intracranial Pressure",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 42-year-old client with a traumatic brain injury has ICP monitoring in place. The nurse notes ICP readings of 28 mmHg for 10 minutes. Which action is the priority?",
    "choices": [
      "Lower the head of the bed to improve cerebral perfusion pressure",
      "Notify the provider immediately about the sustained elevated ICP",
      "Suction the client to clear secretions and improve oxygenation",
      "Turn the client side to side every 2 hours to prevent complications"
    ],
    "answer": "Notify the provider immediately about the sustained elevated ICP",
    "rationale": "Normal ICP is 5-15 mmHg. Sustained ICP >20 mmHg is critical and requires immediate intervention to prevent herniation. Provider notification is priority for possible osmotic therapy or surgical decompression. HOB should be elevated 30 degrees, not lowered. Suctioning and turning increase ICP.",
    "case": {
      "tabs": {
        "case_study": "42M with severe TBI and sustained elevated ICP requiring emergent management",
        "vitals": "BP 168/92, HR 58, RR 12 irregular, ICP 28 mmHg sustained",
        "labs": "Serum osmolality 285, sodium 138",
        "nursing_actions": "Maintain HOB 30°, minimize stimulation, ensure adequate sedation",
        "md_orders": "Mannitol 1g/kg IV if ICP >25, maintain CPP >60, consider ventriculostomy"
      }
    }
  },
  {
    "id": "CA-2026-021",
    "bank": "Compass A",
    "system": "Neurologic",
    "topic": "Seizure Management",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client is having a tonic-clonic seizure. Which action should the nurse take?",
    "choices": [
      "Insert a padded tongue blade between the teeth to prevent tongue biting",
      "Restrain the client's movements to prevent injury during the seizure",
      "Turn the client to the side to maintain a patent airway",
      "Attempt to give oral diazepam to stop the seizure activity"
    ],
    "answer": "Turn the client to the side to maintain a patent airway",
    "rationale": "During active seizure: protect airway by turning to side (prevents aspiration), protect from injury (pad side rails, move objects), do NOT restrain, do NOT force anything into mouth (risk tooth/jaw damage). Time the seizure. Oral medications cannot be given during active seizure.",
    "case": {
      "tabs": {
        "case_study": "Client experiencing generalized tonic-clonic seizure requiring safe management",
        "vitals": "During seizure: tachycardia, irregular respirations",
        "labs": "Awaiting post-ictal assessment",
        "nursing_actions": "Turn to side, protect head, remove nearby objects, time seizure, suction available",
        "md_orders": "Lorazepam 2mg IV if seizure >5 minutes, obtain seizure precautions"
      }
    }
  },
  {
    "id": "CA-2026-022",
    "bank": "Compass A",
    "system": "Neurologic",
    "topic": "Multiple Sclerosis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is planning care for a client with multiple sclerosis who has ataxia. Which intervention should the nurse include in the plan of care?",
    "choices": [
      "Add thickener to thin liquids for the client",
      "Obtain a referral to physical therapy for the client",
      "Face the client directly when speaking with the client",
      "Provide a board with pictures to help the client communicate needs"
    ],
    "answer": "Obtain a referral to physical therapy for the client",
    "rationale": "Ataxia = impaired coordination and balance. Physical therapy provides gait training, balance exercises, assistive devices. Thickened liquids are for dysphagia, not ataxia. Facing directly is for hearing impairment. Picture board is for aphasia. Each intervention addresses different neurologic deficit.",
    "case": {
      "tabs": {
        "case_study": "Client with MS experiencing ataxia requiring mobility assistance",
        "vitals": "Stable, no acute issues",
        "labs": "MRI shows demyelinating plaques consistent with MS",
        "nursing_actions": "Fall precautions, assist with ambulation, assess safety",
        "md_orders": "PT consult for gait training, walker evaluation, home safety assessment"
      }
    }
  },
  {
    "id": "CA-2026-023",
    "bank": "Compass A",
    "system": "Neurologic",
    "topic": "Alzheimer's Disease",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is planning care for a client with moderate Alzheimer's disease. Which intervention should the nurse include in the plan of care?",
    "choices": [
      "Encourage the client to reminisce about happy memories",
      "Confront the client when inappropriate or agitated behaviors occur",
      "Administer the cholinesterase inhibitor to reverse the course of AD",
      "Provide the client with information about activity choices in the morning so the client can make plans for the day"
    ],
    "answer": "Encourage the client to reminisce about happy memories",
    "rationale": "Reminiscence therapy is therapeutic for AD—long-term memory often preserved longer. Do NOT confront (causes agitation). Cholinesterase inhibitors slow progression but don't reverse disease. Multiple choices overwhelm moderate AD clients—provide simple, structured routines instead.",
    "case": {
      "tabs": {
        "case_study": "Client with moderate Alzheimer's requiring therapeutic interventions",
        "vitals": "Stable",
        "labs": "MMSE score 14/30 (moderate impairment)",
        "nursing_actions": "Structured routine, validation therapy, redirection for agitation",
        "md_orders": "Donepezil 10mg daily, memantine 10mg BID, reality orientation, avoid restraints"
      }
    }
  },
  {
    "id": "CA-2026-024",
    "bank": "Compass A",
    "system": "Neurologic",
    "topic": "Spinal Cord Injury",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with a C5 spinal cord injury suddenly reports severe pounding headache, blurred vision, and is diaphoretic above the level of injury. BP is 210/118. Which action should the nurse take first?",
    "choices": [
      "Administer prescribed antihypertensive medication immediately",
      "Check for bladder distention or fecal impaction",
      "Lower the head of the bed to improve cerebral perfusion",
      "Notify the provider about the hypertensive emergency"
    ],
    "answer": "Check for bladder distention or fecal impaction",
    "rationale": "Autonomic dysreflexia (AD) = medical emergency from noxious stimuli below injury level. First action: identify and remove trigger (most common: bladder distention, fecal impaction, tight clothing). Then elevate HOB to lower BP. If trigger removal doesn't resolve, then give antihypertensives and notify provider.",
    "case": {
      "tabs": {
        "case_study": "Client with C5 SCI experiencing autonomic dysreflexia requiring immediate intervention",
        "vitals": "BP 210/118 (baseline 110/70), HR 54, severe headache, diaphoresis above injury",
        "labs": "Injury level C5 - intact sympathetic response below injury",
        "nursing_actions": "Sit upright immediately, check bladder/bowel, remove tight clothing",
        "md_orders": "Bladder scan, straight cath if distended, nifedipine 10mg SL if BP remains >150 systolic after trigger removal"
      }
    }
  },
  {
    "id": "CA-2026-025",
    "bank": "Compass A",
    "system": "Neurologic",
    "topic": "Cerebral Concussion",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 3-year-old client with a cerebral concussion is being observed overnight in the pediatric unit. Which observation is most significant for the nurse to report to the oncoming shift?",
    "choices": [
      "The client has a blood pressure of 94/58 mm Hg and an apical pulse of 90",
      "The client is sleeping but is easily aroused",
      "The client's pupils are equal and reactive to light",
      "The client has an axillary temperature of 99.0°F (37.2°C) and respirations of 24"
    ],
    "answer": "The client is sleeping but is easily aroused",
    "rationale": "After concussion, being easily aroused is GOOD—indicates appropriate LOC. BP 94/58 and P 90 are normal for 3-year-old. Equal reactive pupils are normal. Temp 99°F and RR 24 are normal. The question asks what to report—all findings are reassuring and normal, so the nurse would report that neuro status is stable.",
    "case": {
      "tabs": {
        "case_study": "3-year-old with concussion showing reassuring neurologic status",
        "vitals": "BP 94/58, P 90, RR 24, Temp 99.0°F axillary",
        "labs": "Pupils equal and reactive, easily aroused, no vomiting",
        "nursing_actions": "Neuro checks q2h overnight, assess for change in LOC",
        "md_orders": "Observe overnight, discharge if stable in AM, concussion precautions"
      }
    }
  },
  {
    "id": "CA-2026-026",
    "bank": "Compass A",
    "system": "Endocrine",
    "topic": "Diabetic Ketoacidosis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 24-year-old client with type 1 diabetes presents with DKA. Labs: glucose 524 mg/dL, K+ 3.1 mEq/L, pH 7.18, HCO3 10 mEq/L. Provider orders regular insulin 0.1 units/kg/hr IV. What should the nurse do BEFORE starting insulin?",
    "choices": [
      "Begin the insulin infusion immediately to lower critically elevated blood glucose",
      "Administer IV potassium chloride 20 mEq per DKA protocol",
      "Recheck blood glucose using a different glucometer to verify result",
      "Administer sodium bicarbonate 50 mEq IV to rapidly correct acidosis"
    ],
    "answer": "Administer IV potassium chloride 20 mEq per DKA protocol",
    "rationale": "K+ is 3.1 mEq/L (low). In DKA, total body K+ is depleted. Insulin drives K+ INTO cells, further lowering serum K+ and causing life-threatening dysrhythmias. K+ MUST be >3.3 mEq/L BEFORE starting insulin. Bicarbonate only indicated if pH <7.0. Glucose is accurate.",
    "case": {
      "tabs": {
        "case_study": "24F with type 1 DM presenting with DKA and hypokalemia",
        "vitals": "BP 98/62, HR 118, RR 32 Kussmaul, SpO2 97% RA, Temp 98.9°F, Wt 58kg",
        "labs": "Glucose 524, K+ 3.1, Na+ 131, pH 7.18, HCO3 10, anion gap 24, large ketones",
        "nursing_actions": "NS bolus 1L given, cardiac monitoring, second IV access",
        "md_orders": "Correct K+ to >3.3 before insulin, then insulin 0.1 units/kg/hr, NS 250-500 mL/hr, q1h glucose/K+"
      }
    }
  },
  {
    "id": "CA-2026-027",
    "bank": "Compass A",
    "system": "Endocrine",
    "topic": "Hypoglycemia",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 56-year-old client with type 2 diabetes on insulin reports feeling shaky, sweaty, and confused. Blood glucose is 48 mg/dL. The client is awake and able to swallow. Which action should the nurse take?",
    "choices": [
      "Administer glucagon 1 mg intramuscularly immediately",
      "Give 15 grams of fast-acting carbohydrate such as 4 oz orange juice",
      "Give the client a peanut butter sandwich and whole milk",
      "Start dextrose 50% IV and give 50 mL IV push"
    ],
    "answer": "Give 15 grams of fast-acting carbohydrate such as 4 oz orange juice",
    "rationale": "Hypoglycemia in conscious client who can swallow: give 15g fast-acting carbs (4 oz juice, glucose tabs, hard candy). Recheck in 15 min. Glucagon is for unconscious/unable to swallow. D50W is for unconscious or no IV access. Peanut butter/milk are too slow (protein/fat delay absorption).",
    "case": {
      "tabs": {
        "case_study": "56M with type 2 DM experiencing hypoglycemia, alert and able to swallow",
        "vitals": "BP 138/84, HR 102, RR 18, diaphoretic, tremulous",
        "labs": "Blood glucose 48 mg/dL (by fingerstick)",
        "nursing_actions": "Administer fast carbs, recheck glucose in 15 minutes, give meal if next meal >1hr away",
        "md_orders": "Treat hypoglycemia per protocol, review insulin regimen, consider dose adjustment"
      }
    }
  },
  {
    "id": "CA-2026-028",
    "bank": "Compass A",
    "system": "Endocrine",
    "topic": "Thyroid Storm",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 38-year-old client with untreated Graves' disease presents to the ED with fever 104.2°F, HR 156, BP 168/102, agitation, and diarrhea. Which medication should the nurse anticipate administering first?",
    "choices": [
      "Levothyroxine IV to replace depleted thyroid hormone",
      "Propranolol IV to block sympathetic effects",
      "Insulin IV to lower blood glucose",
      "Calcium gluconate IV for tetany"
    ],
    "answer": "Propranolol IV to block sympathetic effects",
    "rationale": "This is thyroid storm (life-threatening hyperthyroidism). Treatment: (1) Beta-blocker (propranolol) blocks sympathetic symptoms immediately, (2) Antithyroid drugs (PTU/methimazole) block synthesis, (3) Iodine blocks hormone release, (4) Supportive care (cooling, fluids). Levothyroxine worsens hyperthyroidism. Calcium for hypothyroidism surgery.",
    "case": {
      "tabs": {
        "case_study": "38F with thyroid storm requiring emergent treatment",
        "vitals": "Temp 104.2°F, HR 156, BP 168/102, agitated, tremulous, diarrhea",
        "labs": "TSH <0.01, Free T4 >7.0, glucose 168",
        "nursing_actions": "Cooling measures, cardiac monitoring, IV access",
        "md_orders": "Propranolol 1mg IV q10-15min PRN HR, PTU 600mg loading dose, SSKI, dexamethasone, cooling blanket"
      }
    }
  },
  {
    "id": "CA-2026-029",
    "bank": "Compass A",
    "system": "Endocrine",
    "topic": "Addisonian Crisis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with Addison's disease who stopped taking prednisone presents with severe weakness, hypotension 78/42, confusion, and abdominal pain. Which intervention is the priority?",
    "choices": [
      "Administer oral prednisone 20 mg immediately",
      "Start IV hydrocortisone 100 mg and 0.9% NaCl bolus",
      "Check blood glucose and give orange juice if low",
      "Obtain blood samples for cortisol level before any treatment"
    ],
    "answer": "Start IV hydrocortisone 100 mg and 0.9% NaCl bolus",
    "rationale": "Addisonian crisis (acute adrenal insufficiency) = life-threatening. Immediate treatment: IV hydrocortisone (acts within minutes) + IV saline (correct severe hypovolemia and hypotension). Do NOT delay for labs—draw blood but start treatment immediately. Cannot give PO when unstable. Glucose is important but not priority over hydrocortisone.",
    "case": {
      "tabs": {
        "case_study": "Client in Addisonian crisis after stopping corticosteroids",
        "vitals": "BP 78/42, HR 124, Temp 99.8°F, lethargic",
        "labs": "K+ 5.8, Na+ 128, glucose 62, cortisol pending (but don't wait)",
        "nursing_actions": "Large-bore IV x2, continuous monitoring, prepare for ICU",
        "md_orders": "Hydrocortisone 100mg IV STAT then q6h, NS bolus 1L wide open then 1L over 1hr, glucose monitoring"
      }
    }
  },
  {
    "id": "CA-2026-030",
    "bank": "Compass A",
    "system": "Endocrine",
    "topic": "SIADH",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 62-year-old client with small cell lung cancer has labs showing Na+ 118 mEq/L, serum osmolality 260 mOsm/kg, urine specific gravity 1.035. The client is confused and reports headache. What is the priority intervention?",
    "choices": [
      "Administer 3% hypertonic saline IV per protocol",
      "Encourage increased oral fluid intake to 3 liters daily",
      "Administer furosemide 40 mg IV to promote diuresis",
      "Restrict sodium intake to <2 grams per day"
    ],
    "answer": "Administer 3% hypertonic saline IV per protocol",
    "rationale": "SIADH: low sodium (118), low serum osmolality (260), HIGH urine specific gravity (1.035 = concentrated). Severe hyponatremia <120 with symptoms requires hypertonic saline (3% NaCl). SIADH treatment is fluid restriction (not increased fluids). Loop diuretics worsen sodium loss. Need sodium, not restriction.",
    "case": {
      "tabs": {
        "case_study": "62M with SIADH from small cell lung cancer, severe symptomatic hyponatremia",
        "vitals": "BP 128/76, HR 88, confused, headache",
        "labs": "Na+ 118 (critical), serum osm 260, urine SG 1.035, urine Na+ 45",
        "nursing_actions": "Seizure precautions, neuro checks, strict I&O",
        "md_orders": "3% NaCl 100mL over 1hr, recheck Na+ q2h, goal increase 4-6 mEq/L in 24hr, fluid restrict 800mL/day"
      }
    }
  },
  {
    "id": "CA-2026-031",
    "bank": "Compass A",
    "system": "Endocrine",
    "topic": "Diabetes Insipidus",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client who had a transsphenoidal hypophysectomy yesterday has urine output of 650 mL/hour for 2 hours, specific gravity 1.002, and reports extreme thirst. Which intervention should the nurse anticipate?",
    "choices": [
      "Restrict fluids to 1 liter per day to reduce urine output",
      "Administer desmopressin (DDAVP) as prescribed",
      "Increase IV fluid rate to match urine output",
      "Document findings as expected postoperative diuresis"
    ],
    "answer": "Administer desmopressin (DDAVP) as prescribed",
    "rationale": "Diabetes insipidus (DI) after pituitary surgery: massive dilute urine (>200 mL/hr), very low specific gravity (<1.005), polydipsia. Treatment: desmopressin (synthetic ADH). Match fluid replacement but MUST give DDAVP or client will become severely dehydrated. Fluid restriction worsens problem. Not normal postop.",
    "case": {
      "tabs": {
        "case_study": "Post-hypophysectomy patient with DI requiring immediate treatment",
        "vitals": "BP 102/68, HR 108, thirsty, alert",
        "labs": "Urine output 650 mL/hr x2hr, SG 1.002, serum Na+ 152, serum osm 310",
        "nursing_actions": "Strict I&O, hourly urine output monitoring, provide fluids",
        "md_orders": "DDAVP 4 mcg IV q12h, replace urine output mL for mL with IV fluids, monitor serum Na+ q4h"
      }
    }
  },
  {
    "id": "CA-2026-032",
    "bank": "Compass A",
    "system": "GI/Hepatic",
    "topic": "Upper GI Bleeding",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 58-year-old client with a history of alcohol use disorder presents with hematemesis. BP 88/52, HR 128, cool clammy skin. Which action is the priority?",
    "choices": [
      "Insert a nasogastric tube to assess for active bleeding",
      "Establish two large-bore IV lines and begin fluid resuscitation",
      "Prepare client for immediate upper endoscopy",
      "Administer pantoprazole 80 mg IV bolus"
    ],
    "answer": "Establish two large-bore IV lines and begin fluid resuscitation",
    "rationale": "Hematemesis + hypovolemic shock (BP 88/52, HR 128, cold clammy) = life-threatening hemorrhage. PRIORITY: IV access (2 large-bore) and fluid resuscitation (crystalloid/blood products). Then NG tube, PPI, endoscopy. ABCs first - restore perfusion before diagnostic procedures.",
    "case": {
      "tabs": {
        "case_study": "58M with acute upper GI bleed and hypovolemic shock",
        "vitals": "BP 88/52, HR 128, RR 24, cool clammy skin, large volume hematemesis",
        "labs": "Hgb 7.2 (was 13.1), Hct 22%, platelets 88K, INR 1.8",
        "nursing_actions": "2 large-bore IVs, crystalloid bolus, type and cross 4 units PRBCs",
        "md_orders": "NS 1L bolus x2, transfuse 2 units PRBC STAT, octreotide infusion, emergent EGD"
      }
    }
  },
  {
    "id": "CA-2026-033",
    "bank": "Compass A",
    "system": "GI/Hepatic",
    "topic": "Appendicitis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 41-year-old client with suspected appendicitis reports sudden relief of abdominal pain. Vital signs: T 102.5°F, P 110, BP 125/86. What should the nurse recognize about this finding?",
    "choices": [
      "The appendicitis is resolving and antibiotics are working",
      "The appendix may have ruptured requiring immediate intervention",
      "The client needs stronger pain medication for breakthrough pain",
      "This is a normal response to IV fluid hydration"
    ],
    "answer": "The appendix may have ruptured requiring immediate intervention",
    "rationale": "Sudden pain relief with appendicitis = ruptured appendix (pressure released). This is WORSE, not better—leads to peritonitis and sepsis. Tachycardia (110) and fever persist. Requires urgent surgical intervention and antibiotics. Not from pain meds or fluids.",
    "case": {
      "tabs": {
        "case_study": "41M with ruptured appendix progressing to peritonitis",
        "vitals": "Temp 102.5°F, P 110, BP 125/86, sudden pain relief then diffuse tenderness",
        "labs": "WBC 18.5, CT: free intraperitoneal fluid, ruptured appendix",
        "nursing_actions": "NPO, IV antibiotics, notify surgeon STAT",
        "md_orders": "Emergency appendectomy, broad-spectrum antibiotics, IV fluids"
      }
    }
  },
  {
    "id": "CA-2026-034",
    "bank": "Compass A",
    "system": "GI/Hepatic",
    "topic": "Hepatic Encephalopathy",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with cirrhosis is confused and has asterixis (flapping tremor). Ammonia level is 180 mcg/dL (normal <40). Which intervention should the nurse anticipate?",
    "choices": [
      "Administer lactulose 30 mL PO every 6 hours",
      "Encourage increased dietary protein to improve nutrition",
      "Administer albumin 25% IV for low serum albumin",
      "Restrict all fluids to prevent worsening ascites"
    ],
    "answer": "Administer lactulose 30 mL PO every 6 hours",
    "rationale": "Hepatic encephalopathy from high ammonia. Lactulose acidifies colon, traps ammonia, promotes excretion. Goal: 2-3 soft stools/day. REDUCE protein (not increase)—protein breakdown produces ammonia. Albumin treats fluid shifts but not encephalopathy. Fluids not primary issue.",
    "case": {
      "tabs": {
        "case_study": "Client with cirrhosis and hepatic encephalopathy from elevated ammonia",
        "vitals": "BP 118/72, HR 84, confused, asterixis present",
        "labs": "Ammonia 180 (critical), albumin 2.4, bilirubin 4.8",
        "nursing_actions": "Safety measures, fall precautions, monitor mental status",
        "md_orders": "Lactulose 30mL PO q6h (goal 2-3 BM/day), reduce protein to 60g/day, rifaximin"
      }
    }
  },
  {
    "id": "CA-2026-035",
    "bank": "Compass A",
    "system": "GI/Hepatic",
    "topic": "Bowel Obstruction",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 72-year-old client with suspected small bowel obstruction has absent bowel sounds, abdominal distention, and is vomiting bile-colored emesis. Which intervention is contraindicated?",
    "choices": [
      "Inserting a nasogastric tube for decompression",
      "Administering a soapsuds enema to stimulate bowel evacuation",
      "Maintaining NPO status and starting IV fluids",
      "Measuring abdominal girth every 4 hours"
    ],
    "answer": "Administering a soapsuds enema to stimulate bowel evacuation",
    "rationale": "Enemas are CONTRAINDICATED in bowel obstruction—increase pressure and risk perforation. Correct management: NG decompression, NPO, IV fluids, monitor girth. Surgery may be needed. Never give laxatives or enemas with obstruction.",
    "case": {
      "tabs": {
        "case_study": "72M with small bowel obstruction requiring decompression",
        "vitals": "BP 108/68, HR 96, abdominal distention, absent bowel sounds",
        "labs": "Abdominal X-ray: dilated small bowel loops, air-fluid levels",
        "nursing_actions": "NPO, NG tube to suction, IV fluids, monitor for perforation signs",
        "md_orders": "NG to low continuous suction, NS 125 mL/hr, surgical consult, serial abdominal exams"
      }
    }
  },
  {
    "id": "CA-2026-036",
    "bank": "Compass A",
    "system": "GI/Hepatic",
    "topic": "Pancreatitis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 48-year-old client with acute pancreatitis reports severe epigastric pain radiating to the back, rated 9/10. Which intervention is most appropriate?",
    "choices": [
      "Place client supine to reduce pressure on pancreas",
      "Position client in sitting position leaning forward",
      "Apply heating pad to abdomen for pain relief",
      "Encourage oral intake of clear liquids"
    ],
    "answer": "Position client in sitting position leaning forward",
    "rationale": "Pancreatitis pain relief: sitting up, leaning forward (reduces pancreatic capsule tension). Supine worsens pain. NO heat (increases metabolic demand). NPO initially to rest pancreas. Also give IV opioids (morphine, hydromorphone) for severe pain.",
    "case": {
      "tabs": {
        "case_study": "48F with acute pancreatitis and severe pain requiring comfort measures",
        "vitals": "BP 138/88, HR 102, severe epigastric pain radiating to back",
        "labs": "Lipase 2,800 (normal <160), amylase 980, calcium 7.8",
        "nursing_actions": "NPO, IV fluids, position for comfort, pain management",
        "md_orders": "Morphine 2-4mg IV q2h PRN, NPO, NS 150 mL/hr, antiemetics"
      }
    }
  },
  {
    "id": "CA-2026-037",
    "bank": "Compass A",
    "system": "Renal/Urinary",
    "topic": "Acute Kidney Injury",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client's lab results show: BUN 68 mg/dL, creatinine 4.2 mg/dL, K+ 6.2 mEq/L, bicarbonate 18 mEq/L. ECG shows peaked T waves. Which intervention is the priority?",
    "choices": [
      "Administer sodium polystyrene sulfonate (Kayexalate) PO",
      "Prepare for hemodialysis with vascular access",
      "Administer calcium gluconate 1 gram IV",
      "Place client on cardiac monitor and obtain 12-lead ECG"
    ],
    "answer": "Administer calcium gluconate 1 gram IV",
    "rationale": "K+ 6.2 with peaked T waves = life-threatening hyperkalemia with cardiac toxicity. FIRST: calcium gluconate IV (stabilizes cardiac membrane within minutes). THEN: shift K+ intracellularly (insulin/glucose, albuterol), remove K+ (Kayexalate, dialysis). Cardiac monitoring is important but calcium is the immediate lifesaving intervention.",
    "case": {
      "tabs": {
        "case_study": "Client with AKI and severe hyperkalemia with ECG changes",
        "vitals": "BP 168/94, HR 86, ECG: peaked T waves, widened QRS",
        "labs": "K+ 6.2, BUN 68, Cr 4.2, pH 7.28, UOP <400 mL/24hr",
        "nursing_actions": "Continuous telemetry, prepare for dialysis",
        "md_orders": "Calcium gluconate 1g IV STAT, insulin 10 units + D50W 50mL IV, albuterol neb, dialysis urgently"
      }
    }
  },
  {
    "id": "CA-2026-038",
    "bank": "Compass A",
    "system": "Renal/Urinary",
    "topic": "Urinary Retention",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client who had a total abdominal hysterectomy 1 day ago is unable to void 7 hours after the indwelling catheter was removed. The client reports lower abdominal discomfort. What should the nurse do first?",
    "choices": [
      "Encourage increased oral fluid intake to stimulate voiding",
      "Perform a bladder scan to assess for urinary retention",
      "Re-insert an indwelling urethral catheter immediately",
      "Assist the client to ambulate to the bathroom"
    ],
    "answer": "Perform a bladder scan to assess for urinary retention",
    "rationale": "Unable to void 7 hours post-catheter removal suggests retention. FIRST: assess (bladder scan) to determine volume. If >400-500 mL, may need straight catheterization. Don't force fluids before confirming retention. Don't re-insert indwelling catheter without assessing volume—may only need one straight cath.",
    "case": {
      "tabs": {
        "case_study": "Post-hysterectomy patient with suspected urinary retention",
        "vitals": "BP 128/76, HR 88, lower abdominal fullness and discomfort",
        "labs": "Bladder scan will determine volume",
        "nursing_actions": "Bladder scan, privacy for voiding attempts, pain management",
        "md_orders": "If bladder scan >400mL, perform straight catheterization; may need indwelling if unable to void x2"
      }
    }
  },
  {
    "id": "CA-2026-039",
    "bank": "Compass A",
    "system": "Renal/Urinary",
    "topic": "Chronic Kidney Disease",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with stage 5 chronic kidney disease on hemodialysis reports shortness of breath between dialysis sessions. Lung auscultation reveals crackles bilaterally. Which dietary teaching is most important?",
    "choices": [
      "Increase protein intake to 1.5 grams per kilogram daily",
      "Limit fluid intake to 1000 mL per day plus urine output",
      "Increase potassium-rich foods like bananas and oranges",
      "Take calcium supplements with every meal"
    ],
    "answer": "Limit fluid intake to 1000 mL per day plus urine output",
    "rationale": "Dyspnea and crackles between dialysis = fluid overload. Stage 5 CKD requires strict fluid restriction (typically 1000 mL + previous day's urine output). AVOID high-protein diets (increase BUN). RESTRICT potassium (not increase). Calcium needs phosphate binders, not just supplements.",
    "case": {
      "tabs": {
        "case_study": "Client with ESRD on HD experiencing volume overload",
        "vitals": "BP 168/96, RR 24, bilateral crackles, 3+ pedal edema",
        "labs": "Interdialytic weight gain 5 kg, BUN 82, K+ 5.4",
        "nursing_actions": "Reinforce fluid restriction, daily weights, lung assessment",
        "md_orders": "Fluid restrict per renal diet, may need extra dialysis session if severely overloaded"
      }
    }
  },
  {
    "id": "CA-2026-040",
    "bank": "Compass A",
    "system": "Renal/Urinary",
    "topic": "Nephrotic Syndrome",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with nephrotic syndrome has 4+ proteinuria, serum albumin 2.1 g/dL, and 3+ pitting edema in both legs. Which complication is this client at highest risk for developing?",
    "choices": [
      "Hypertensive crisis from fluid overload",
      "Pulmonary embolism from hypercoagulability",
      "Acute kidney injury from dehydration",
      "Metabolic acidosis from protein loss"
    ],
    "answer": "Pulmonary embolism from hypercoagulability",
    "rationale": "Nephrotic syndrome causes massive protein loss including anticoagulant proteins (antithrombin III, protein C/S), creating HYPERcoagulable state. Risk of DVT/PE. Also lose immunoglobulins (infection risk). Typically HYPOtension (not hypertension) from third-spacing. Alkalosis (not acidosis) more common.",
    "case": {
      "tabs": {
        "case_study": "Client with nephrotic syndrome at risk for thromboembolism",
        "vitals": "BP 108/68, HR 88, 3+ pitting edema bilateral legs",
        "labs": "Albumin 2.1 (low), 24hr urine protein 8.5g, cholesterol 380, low antithrombin III",
        "nursing_actions": "Monitor for DVT/PE signs, encourage mobility, sequential compression devices",
        "md_orders": "Consider prophylactic anticoagulation, diuretics for edema, ACE inhibitor, statin"
      }
    }
  },
  {
    "id": "CA-2026-041",
    "bank": "Compass A",
    "system": "Renal/Urinary",
    "topic": "Urinary Tract Infection",
    "difficulty": 5,
    "qtype": "single",
    "stem": "An 82-year-old female from a long-term care facility presents with altered mental status, fever 101.8°F, and foul-smelling urine. Vitals: BP 84/50, HR 128. What should the nurse recognize?",
    "choices": [
      "This is a simple UTI requiring oral antibiotics",
      "The client is experiencing urosepsis and requires immediate intervention",
      "Dehydration is the primary problem requiring IV fluid bolus only",
      "The altered mental status is unrelated to the urinary symptoms"
    ],
    "answer": "The client is experiencing urosepsis and requires immediate intervention",
    "rationale": "UTI + systemic signs (fever, hypotension 84/50, tachycardia 128, altered mental status) = SEPSIS from urinary source. Requires sepsis bundle: blood cultures, broad-spectrum antibiotics within 1 hour, aggressive fluid resuscitation, lactate measurement. Not just simple UTI or dehydration—this is septic shock.",
    "case": {
      "tabs": {
        "case_study": "82F with urosepsis and septic shock from UTI",
        "vitals": "BP 84/50, HR 128, Temp 101.8°F, altered mental status",
        "labs": "WBC 18K, lactate 4.2, UA: bacteria and WBCs, blood cultures pending",
        "nursing_actions": "Sepsis protocol, large-bore IVs, continuous monitoring",
        "md_orders": "Sepsis bundle: cultures, ceftriaxone 2g IV, NS 30 mL/kg bolus, vasopressors if needed"
      }
    }
  },
  {
    "id": "CA-2026-042",
    "bank": "Compass A",
    "system": "Infectious Diseases/Micro",
    "topic": "Isolation Precautions",
    "difficulty": 5,
    "qtype": "single",
    "stem": "The nurse is observing a staff member caring for a client with chickenpox. Which action would require the nurse to intervene?",
    "choices": [
      "Placing the client in a private room with monitored negative air pressure",
      "Placing a box of disposable face shields outside the client's room",
      "Placing an alcohol-based hand rub in the client's room for hand hygiene",
      "Placing a surgical mask on the client during transport out of the room"
    ],
    "answer": "Placing a box of disposable face shields outside the client's room",
    "rationale": "Chickenpox requires airborne + contact precautions: negative pressure room (correct), N95 respirator (NOT face shield—airborne particles need N95), gown/gloves for contact, alcohol hand rub OK, mask client during transport (correct). Face shields don't filter airborne particles.",
    "case": {
      "tabs": {
        "case_study": "Client with varicella requiring proper isolation precautions",
        "vitals": "Temp 100.9°F, vesicular rash in various stages",
        "labs": "Clinical diagnosis: varicella zoster virus",
        "nursing_actions": "Airborne + contact precautions, N95 respirator required",
        "md_orders": "Isolation until all lesions crusted, antivirals if immunocompromised"
      }
    }
  },
  {
    "id": "CA-2026-043",
    "bank": "Compass A",
    "system": "Infectious Diseases/Micro",
    "topic": "Clostridium Difficile",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client develops watery diarrhea (>10 stools/day) after 5 days of ceftriaxone therapy. C. difficile toxin is positive. Which precaution is most important?",
    "choices": [
      "Airborne precautions with N95 respirator",
      "Contact precautions with soap and water handwashing",
      "Droplet precautions with surgical mask",
      "Standard precautions only, C. diff is not transmitted"
    ],
    "answer": "Contact precautions with soap and water handwashing",
    "rationale": "C. diff requires contact precautions: private room, gown/gloves. CRITICAL: alcohol hand rub does NOT kill C. diff spores—must use SOAP and WATER. Spores transmitted via contact with contaminated surfaces. Not airborne or droplet.",
    "case": {
      "tabs": {
        "case_study": "Client with antibiotic-associated C. difficile colitis",
        "vitals": "Temp 100.2°F, >10 watery stools/24hr, abdominal cramping",
        "labs": "C. diff toxin positive, WBC 16.8",
        "nursing_actions": "Contact precautions, soap/water handwashing, private room",
        "md_orders": "D/C ceftriaxone, start vancomycin 125mg PO QID, replace fluids and electrolytes"
      }
    }
  },
  {
    "id": "CA-2026-044",
    "bank": "Compass A",
    "system": "Infectious Diseases/Micro",
    "topic": "Meningitis",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 19-year-old college student presents with severe headache, fever 103.2°F, nuchal rigidity, and petechial rash. Lumbar puncture shows cloudy CSF. What is the priority nursing action?",
    "choices": [
      "Initiate droplet precautions and administer antibiotics within 1 hour",
      "Perform a complete neurologic assessment and document findings",
      "Decrease environmental stimuli and dim the lights in the room",
      "Administer acetaminophen 650 mg PO for fever reduction"
    ],
    "answer": "Initiate droplet precautions and administer antibiotics within 1 hour",
    "rationale": "Bacterial meningitis (likely Neisseria meningitidis given petechiae and age): droplet precautions + antibiotics within 1 hour. Time-critical—mortality increases with delays. Ceftriaxone or cefotaxime immediately. Neurologic assessment and comfort measures are important but antibiotics are priority.",
    "case": {
      "tabs": {
        "case_study": "19M with suspected bacterial (meningococcal) meningitis",
        "vitals": "Temp 103.2°F, HR 118, BP 108/68, severe headache, photophobia",
        "labs": "CSF: cloudy, elevated WBC, decreased glucose, Gram stain pending",
        "nursing_actions": "Droplet precautions, maintain quiet dark environment, seizure precautions",
        "md_orders": "Ceftriaxone 2g IV STAT, dexamethasone 10mg IV before antibiotics, droplet isolation"
      }
    }
  },
  {
    "id": "CA-2026-045",
    "bank": "Compass A",
    "system": "Infectious Diseases/Micro",
    "topic": "HIV/AIDS",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client with AIDS has a CD4 count of 48 cells/mm³ and reports white patches in the mouth that can be scraped off, leaving red areas. What should the nurse recognize?",
    "choices": [
      "This is oral hairy leukoplakia indicating Epstein-Barr virus infection",
      "This is oral candidiasis requiring antifungal therapy",
      "This is Kaposi's sarcoma requiring oncology referral",
      "This is aphthous stomatitis requiring topical anesthetic"
    ],
    "answer": "This is oral candidiasis requiring antifungal therapy",
    "rationale": "White patches that SCRAPE OFF = oral candidiasis (thrush), common with CD4 <200. Treatment: nystatin swish/swallow or fluconazole PO. Hairy leukoplakia does NOT scrape off. Kaposi's sarcoma is purple lesions. Aphthous ulcers are painful erosions, not white patches.",
    "case": {
      "tabs": {
        "case_study": "AIDS patient with oral candidiasis from severe immunosuppression",
        "vitals": "Stable, CD4 48 (severe immunosuppression)",
        "labs": "HIV viral load 285,000, CD4 48, opportunistic infection workup",
        "nursing_actions": "Assess for other opportunistic infections, medication adherence",
        "md_orders": "Fluconazole 200mg PO daily x14 days, optimize antiretroviral therapy, PCP prophylaxis"
      }
    }
  },
  {
    "id": "CA-2026-046",
    "bank": "Compass A",
    "system": "Perioperative/Critical Care",
    "topic": "Postoperative Complications",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client who had a laparoscopic cholecystectomy 4 hours ago is reporting right shoulder pain rated 6/10. Vitals are stable. What should the nurse recognize about this finding?",
    "choices": [
      "This indicates surgical bleeding and requires immediate notification",
      "This is referred pain from residual CO2 and is expected",
      "This suggests pulmonary embolism from surgical positioning",
      "This is unrelated to surgery and indicates cardiac ischemia"
    ],
    "answer": "This is referred pain from residual CO2 and is expected",
    "rationale": "Right shoulder pain after laparoscopic surgery = referred pain from residual CO2 gas irritating diaphragm/phrenic nerve. Expected finding. Resolves as CO2 is absorbed. Ambulation helps. Not bleeding (vitals stable), not PE (too early, stable), not cardiac (wrong presentation).",
    "case": {
      "tabs": {
        "case_study": "Post-laparoscopic cholecystectomy patient with referred shoulder pain",
        "vitals": "BP 128/76, HR 82, RR 16, SpO2 97% RA, afebrile",
        "labs": "Postop day 0, stable, small incisions intact",
        "nursing_actions": "Reassure patient, encourage ambulation, provide analgesia",
        "md_orders": "Ibuprofen 400mg PO q6h PRN pain, advance diet as tolerated, ambulate TID"
      }
    }
  },
  {
    "id": "CA-2026-047",
    "bank": "Compass A",
    "system": "Perioperative/Critical Care",
    "topic": "Fat Embolism",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client who had a total knee replacement 24 hours ago is now restless, confused, and has a petechial rash on the chest. Vitals: RR 32, SpO2 88%, HR 118. What should the nurse suspect?",
    "choices": [
      "Allergic reaction to postoperative antibiotics requiring antihistamines",
      "Pulmonary embolism from immobility requiring anticoagulation",
      "Fat embolism syndrome requiring oxygen and supportive care",
      "Surgical site infection requiring wound culture and antibiotics"
    ],
    "answer": "Fat embolism syndrome requiring oxygen and supportive care",
    "rationale": "Fat embolism syndrome: orthopedic surgery/long bone fracture → fat globules in circulation → respiratory distress (hypoxia, tachypnea), petechial rash (chest/axilla/conjunctiva), neurologic changes (restlessness, confusion). Occurs 12-72 hours post-injury/surgery. Treatment: supportive (oxygen, fluids). Not allergy, not typical PE, not infection.",
    "case": {
      "tabs": {
        "case_study": "Post-TKR patient with fat embolism syndrome",
        "vitals": "RR 32, SpO2 88% RA, HR 118, BP 132/86, restless and confused",
        "labs": "Petechiae on chest, ABG shows hypoxemia, CXR may show infiltrates",
        "nursing_actions": "High-flow oxygen, continuous monitoring, prepare for ICU",
        "md_orders": "Oxygen to maintain SpO2 >92%, IV fluids, may need intubation if worsens, supportive care"
      }
    }
  },
  {
    "id": "CA-2026-048",
    "bank": "Compass A",
    "system": "Perioperative/Critical Care",
    "topic": "Compartment Syndrome",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client who had a closed reduction of a fractured tibia with cast application 1 hour ago reports that the casted leg feels hot and tight. Pain is 8/10 despite pain medication. What is the priority action?",
    "choices": [
      "Elevate the leg above heart level to reduce swelling",
      "Apply ice packs around the cast to decrease inflammation",
      "Notify the provider immediately about possible compartment syndrome",
      "Administer additional pain medication as prescribed"
    ],
    "answer": "Notify the provider immediately about possible compartment syndrome",
    "rationale": "Compartment syndrome: tight sensation, increasing pain unrelieved by meds, hot extremity = warning signs. Medical emergency—requires fasciotomy within hours to prevent tissue death. Cast must be bivalved immediately. Don't elevate above heart (decreases arterial flow), don't ice (causes vasoconstriction). Provider notification STAT.",
    "case": {
      "tabs": {
        "case_study": "Post-casting patient with developing compartment syndrome",
        "vitals": "BP 138/84, HR 96, severe pain 8/10 despite pain meds",
        "labs": "Clinical assessment: tight cast, decreased sensation, pain with passive stretch",
        "nursing_actions": "Notify provider STAT, prepare for cast removal/bivalving",
        "md_orders": "Bivalve cast immediately, assess for 6 Ps, measure compartment pressures, possible emergent fasciotomy"
      }
    }
  },
  {
    "id": "CA-2026-049",
    "bank": "Compass A",
    "system": "Perioperative/Critical Care",
    "topic": "Malignant Hyperthermia",
    "difficulty": 5,
    "qtype": "single",
    "stem": "During general anesthesia, a client develops muscle rigidity, tachycardia 156, rapidly rising temperature (now 105.8°F), and dark cola-colored urine. What is the priority intervention?",
    "choices": [
      "Continue surgery but increase IV fluid rate for hydration",
      "Stop all anesthetic agents and administer dantrolene sodium IV",
      "Administer acetaminophen IV for fever management",
      "Apply cooling blankets and continue monitoring"
    ],
    "answer": "Stop all anesthetic agents and administer dantrolene sodium IV",
    "rationale": "Malignant hyperthermia: life-threatening hypermetabolic crisis from genetic reaction to inhaled anesthetics/succinylcholine. Signs: muscle rigidity, tachycardia, rapidly rising temp, acidosis, hyperkalemia, myoglobinuria (dark urine). IMMEDIATE: stop triggering agents, give dantrolene IV, hyperventilate 100% O2, cool patient, treat complications. Don't continue surgery.",
    "case": {
      "tabs": {
        "case_study": "Intraoperative patient with malignant hyperthermia crisis",
        "vitals": "HR 156, Temp 105.8°F (rising rapidly), BP 168/98, muscle rigidity",
        "labs": "Elevated end-tidal CO2, K+ rising, CK elevated, myoglobin in urine",
        "nursing_actions": "Code MH called, stop volatile anesthetics, prepare dantrolene",
        "md_orders": "Dantrolene 2.5 mg/kg IV rapid push (repeat PRN), 100% O2, cool with ice, treat hyperkalemia"
      }
    }
  },
  {
    "id": "CA-2026-050",
    "bank": "Compass A",
    "system": "Perioperative/Critical Care",
    "topic": "Shock",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A client in the ICU has the following assessment: BP 78/40, HR 132 weak and thready, cold clammy skin, urine output 15 mL/hr, altered mental status. Which type of shock does this presentation most likely indicate?",
    "choices": [
      "Anaphylactic shock from allergic reaction",
      "Neurogenic shock from spinal cord injury",
      "Hypovolemic shock from fluid loss",
      "Septic shock from overwhelming infection"
    ],
    "answer": "Hypovolemic shock from fluid loss",
    "rationale": "Classic hypovolemic shock: hypotension, tachycardia, cold clammy skin (compensatory vasoconstriction), decreased UOP, altered mental status. Anaphylactic = warm skin initially, wheezing. Neurogenic = bradycardia, warm dry skin (loss of sympathetic tone). Septic = warm skin initially (vasodilation), fever. This is compensated shock with vasoconstriction.",
    "case": {
      "tabs": {
        "case_study": "ICU patient in hypovolemic shock requiring aggressive resuscitation",
        "vitals": "BP 78/40, HR 132 weak, cold clammy skin, UOP 15 mL/hr, lethargic",
        "labs": "Elevated lactate, decreased CVP, Hct may be decreased if hemorrhage",
        "nursing_actions": "Large-bore IV access, rapid fluid resuscitation, continuous monitoring",
        "md_orders": "NS 2L bolus rapid, blood products if hemorrhage, vasopressors if needed, identify/stop source"
      }
    }
  }
]