[
  {
    "id": "CA-2026-001",
    "bank": "Compass A",
    "system": "Cardiovascular",
    "topic": "Acute Myocardial Infarction",
    "difficulty": 5,
    "qtype": "single",
    "stem": "A 68-year-old male was admitted 2 hours ago with crushing substernal chest pain radiating to the left jaw and arm. He suddenly develops bradycardia.\n\nCurrent Assessment:\nBP: 82/50 (previous 128/76)\nHR: 42 bpm (previous 88 bpm)\nRR: 24 breaths/min\nSpO2: 92% on 2L NC\nECG: ST elevation in leads II, III, aVF with new second-degree AV block type II\nTroponin I: 3.8 ng/mL (normal <0.04)\nClient states: \"I feel really nauseous and dizzy\"\nSkin: Cold, clammy, diaphoretic\n\nThe provider has ordered nitroglycerin 0.4 mg SL PRN for chest pain. What is the nurse's PRIORITY action?",
    "choices": [
      "Administer the nitroglycerin as ordered to relieve chest pain and improve cardiac perfusion",
      "Apply transcutaneous pacing pads immediately and prepare to initiate pacing",
      "Place the client in Trendelenburg position to increase venous return and cardiac output",
      "Administer atropine 0.5 mg IV push to increase the heart rate above 60 bpm"
    ],
    "answer": "Apply transcutaneous pacing pads immediately and prepare to initiate pacing",
    "rationale": "This client has an inferior wall STEMI (ST elevation in II, III, aVF) with development of second-degree AV block type II accompanied by hemodynamic instability (BP dropped from 128/76 to 82/50, symptomatic bradycardia at 42 bpm). Type II blocks are infranodal and can suddenly progress to complete heart block, causing cardiac arrest. Transcutaneous pacing is the priority intervention. CRITICAL: Nitroglycerin is CONTRAINDICATED in inferior MI with suspected right ventricular involvement - it causes venodilation, decreases preload, and will worsen the hypotension. Atropine is ineffective for second-degree type II blocks because the conduction problem is below the AV node.",
    "choice_rationales": {
      "Administer the nitroglycerin as ordered to relieve chest pain and improve cardiac perfusion": "Incorrect - nitroglycerin is contraindicated in RV infarction; will cause severe hypotension",
      "Apply transcutaneous pacing pads immediately and prepare to initiate pacing": "Correct - second-degree type II block with hemodynamic instability requires immediate pacing",
      "Place the client in Trendelenburg position to increase venous return and cardiac output": "Incorrect - not effective for cardiogenic hypotension; delays pacing",
      "Administer atropine 0.5 mg IV push to increase the heart rate above 60 bpm": "Incorrect - atropine ineffective for type II AV block"
    },
    "case": {
      "tabs": {
        "case_study": "68M with acute inferior STEMI complicated by RV involvement, developing 2nd-degree AV block type II with hemodynamic compromise",
        "vitals": "BP 82/50, HR 42, RR 24, SpO2 92% on 2L NC, Temp 98.4°F",
        "labs": "Troponin I 3.8 ng/mL, CK-MB 45 U/L, ECG: ST elevation II/III/aVF, 2° AV block type II",
        "nursing_actions": "Continuous telemetry, large-bore IV x2, oxygen 2L NC, morphine held",
        "md_orders": "ASA 325mg given, HOLD NTG, heparin infusion, prepare for cath lab, pacing pads standby"
      }
    }
  }
]